{
  "chamber": "dail",
  "startDate": "2024-12-01",
  "endDate": "2024-12-31",
  "generatedAt": "2025-11-25T23:43:36.455Z",
  "totalRecords": 1,
  "aggregatedStats": {
    "totalDays": 1,
    "daysWithTranscripts": 1,
    "sections": 18,
    "speeches": 119,
    "uniqueSpeakers": 40,
    "wordCount": 22717
  },
  "debates": [
    {
      "date": "2024-12-18",
      "contextDate": "2024-12-18",
      "chamber": "Dáil Éireann",
      "house": {
        "name": "34th Dáil",
        "code": "dail",
        "number": "34"
      },
      "debateType": "debate",
      "counts": {
        "contributorCount": 172,
        "debateSectionCount": 9,
        "divisionCount": 2,
        "billCount": 0,
        "questionCount": 0
      },
      "xmlSource": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-12-18/debate/mul@/main.xml",
      "xmlLocalPath": "data\\oireachtas\\samples\\raw\\dail_2024-12-18_debate_0.xml",
      "sections": [
        {
          "id": "dbsect_1",
          "title": null,
          "debateType": null,
          "recordedTime": null,
          "containsDebate": null,
          "question": null,
          "speeches": [],
          "subsections": [],
          "metadata": null
        },
        {
          "id": "dbsect_2",
          "title": "DÁIL ÉIREANN",
          "debateType": "debate",
          "recordedTime": "2024-12-18T10:30:00+00:00",
          "containsDebate": true,
          "question": null,
          "speeches": [],
          "subsections": [],
          "metadata": {
            "debateType": "debate",
            "counts": {
              "speakerCount": 0,
              "speechCount": 0
            },
            "containsDebate": true,
            "parentId": null
          }
        },
        {
          "id": "dbsect_3",
          "title": "FORÓGRA",
          "debateType": "debate",
          "recordedTime": "2024-12-18T10:30:00+00:00",
          "containsDebate": false,
          "question": null,
          "speeches": [],
          "subsections": [],
          "metadata": {
            "debateType": "debate",
            "counts": {
              "speakerCount": 0,
              "speechCount": 0
            },
            "containsDebate": false,
            "parentId": null
          }
        },
        {
          "id": "dbsect_4",
          "title": "PROCLAMATION",
          "debateType": "debate",
          "recordedTime": "2024-12-18T10:30:00+00:00",
          "containsDebate": true,
          "question": null,
          "speeches": [],
          "subsections": [],
          "metadata": {
            "debateType": "debate",
            "counts": {
              "speakerCount": 0,
              "speechCount": 0
            },
            "containsDebate": true,
            "parentId": null
          }
        },
        {
          "id": "dbsect_5",
          "title": "Tuarascáil i dtaobh Eascairí a chur amach agus Craoladh i dtaobh Freagraí",
          "debateType": "debate",
          "recordedTime": "2024-12-18T10:30:00+00:00",
          "containsDebate": false,
          "question": null,
          "speeches": [],
          "subsections": [],
          "metadata": {
            "debateType": "debate",
            "counts": {
              "speakerCount": 0,
              "speechCount": 0
            },
            "containsDebate": false,
            "parentId": null
          }
        },
        {
          "id": "dbsect_6",
          "title": "Report as to issue of Writs and Announcement as to Returns",
          "debateType": "debate",
          "recordedTime": "2024-12-18T10:30:00+00:00",
          "containsDebate": true,
          "question": null,
          "speeches": [],
          "subsections": [],
          "metadata": {
            "debateType": "debate",
            "counts": {
              "speakerCount": 0,
              "speechCount": 0
            },
            "containsDebate": true,
            "parentId": null
          }
        },
        {
          "id": "dbsect_7",
          "title": "Ainmniú Iarrthóirí agus Ceann Comhairle a thoghadh - Selection of Candidate and Election of Ceann Comhairle",
          "debateType": "debate",
          "recordedTime": "2024-12-18T10:40:00+00:00",
          "containsDebate": true,
          "question": null,
          "speeches": [
            {
              "id": "spk_1",
              "speaker": null,
              "role": null,
              "recordedTime": "2024-12-18T10:40:00+00:00",
              "speakerLabel": "Cléireach na Dála",
              "paragraphs": [
                "The next item of business is the selection of the Ceann Comhairle of Dáil Éireann – Ceann Comhairle Dháil Éireann a roghnú. I will now proceed to the secret ballot in accordance with Standing Order 6.",
                "I must inform the House that, having received and examined nominations for the position of Ceann Comhairle, the following is the list of validly nominated candidates: Deputy John McGuinness, Deputy Verona Murphy, Deputy Seán Ó Fearghaíl and Deputy Aengus Ó Snodaigh.",
                "As there is more than one candidate, the candidate who will be proposed for election by the House will be selected by secret ballot. Before proceeding to the secret ballot, I will in alphabetical order call on each candidate to speak on their own behalf, or where the candidate has been nominated by another Member to speak on their behalf, I will call on that Member. Each Deputy will have five minutes. I now call on Deputy John McGuinness."
              ],
              "wordCount": 156
            },
            {
              "id": "spk_2",
              "speaker": {
                "id": "JohnMcGuinness",
                "name": "John McGuinness",
                "uri": "/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
              },
              "role": null,
              "recordedTime": "2024-12-18T10:50:00+00:00",
              "speakerLabel": "Deputy John McGuinness",
              "paragraphs": [
                "A Chléirigh agus a chairde, ar an gcéad dul síos, is mór an onóir é dom gur éirigh liom ainmniúchán do phost an Cheann Comhairle a fháil. Gabhaim buíochas dóibh siúd a thug an t-ainmniúchán dom. Gabhaim míle buíochas freisin do gach feisire a bhí sásta labhairt nuair a bhí mo chanbhasáil ar siúl. Molaim an sárobair a rinne na Teachtaí Seán Ó Fearghaíl agus Catherine Connolly. Gabhaim buíochas leo.",
                "I stand here as a candidate for the position of Ceann Comhairle. I have the greatest respect for that office and for the democratic processes within this House. I know there are two sets of opinions here. There is the view that political parties can nominate and suggest to their members how to vote and, in a way, control the outcome. I have a different view which dates back to 2016, when it was decided that the Ceann Comhairle could be nominated by seven Members and the vote would be conducted by secret ballot. I have served since 1997. I have been Minister of State for trade and commerce, Chairman of the Committee of Public Accounts and, more recently, Chairman of the finance committee. In my work on those committees I found that you achieve best by co-operating with the members and by working as one to achieve an end, whatever that end might be.",
                "During the course of the Committee of Public Accounts, many harsh decisions had to be made in respect of how we conduct our business, the election of the Chair and so on. I was there for history to be made when Shane Ross contested against me. Unusually, it fell to the Opposition to fill that Chair, but there was a contest. In working together, that committee saw the resolution to problems that were faced by the likes of Maurice McCabe. The committee saw a resolution, or part of a resolution, to an issue relating to the Grace case, and to the 47 others who were affected by sexual, physical and financial abuse. In more recent times, the finance committee came together to deal with matters such as vulture funds and the tracker mortgage issue, where we were told in the beginning it was 3,000 cases and it turned out to be 50,000-plus cases. All of that work was achieved not by me; it was achieved by all of the members of each of those committees working together to achieve what was best in the interest of the State and in the interest of the individuals concerned. I am saying this to the House today because I believe what is best for the Members of this House is to work together to first ensure you have a Parliament here that will function in your interests. If it functions in your interests, it will, therefore, function in the interests of the people you represent.",
                "Through my years of public service, I have seen where the Dáil Chamber can often be sidelined and I have seen where Members can often be sidelined. Those who are in Government parties are often referred to as being part of the Government but actually there are times when the Government can be just the Cabinet and there are times when the Government can be just the leaders of the groups in that coalition. Because of that, I believe this House has to exercise its strength and its caution around all of the changes that have occurred in politics over that time.",
                "I ask Members as individuals of this Parliament to consider the nominees before you today, protect the interests of this House and the interest of democracy, and elect the best person you see fit to hold the position of Ceann Comhairle to defend your interests and the interests of the people we represent. The last general election told us that we need to build trust with the citizens of this country. We need to restore that trust. I believe the first step in the restoration of that trust is the election of our Ceann Comhairle to reinforce the changes in our democratic structures in the interests of the people we represent and to ensure we work together to deliver for our citizens, keep the Government accountable to this House, ensure transparency and ensure the Government keeps its people safe."
              ],
              "wordCount": 718
            },
            {
              "id": "spk_3",
              "speaker": null,
              "role": null,
              "recordedTime": "2024-12-18T10:50:00+00:00",
              "speakerLabel": "Cléireach na Dála",
              "paragraphs": [
                "Go raibh maith agat, Teachta McGuinness. I now call on Deputy Verona Murphy."
              ],
              "wordCount": 13
            },
            {
              "id": "spk_4",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T10:50:00+00:00",
              "speakerLabel": "Deputy Verona Murphy",
              "paragraphs": [
                "I thank the Clerk. I wish to thank the people of Wexford who once again have put their trust in me to represent them. It is an honour and a privilege to do so. I take this opportunity to thank my colleagues in the Regional Group for the confidence they have placed in me, nominating me for the position of Ceann Comhairle. I pay tribute to the outgoing Ceann Comhairle, in particular for the kindness and guidance he has shown to me and many other Members since his election in 2016. Whatever the outcome of this election, I wish my fellow candidates well. Whoever is elected will have a challenging role. I congratulate all of you, the elected Members of the Thirty-fourth Dáil, on your successful election. The multi-seat constituency electoral dynamic tends to incite an unhealthy competition among colleagues within constituencies, leaving most battle-scarred. Former Wexford politician Avril Doyle once described politics as the last blood sport. From speaking to Members in the past week, that would appear to be a very appropriate description. For those of us who were successful and elected, the wounds will heal quickly. For those unsuccessful candidates who put their names forward and did not succeed, the scars may linger. Either way, they are to be commended on allowing their names to go forward.",
                "Chambers such as these are the lifeblood of a functioning democracy. Having succeeded in being elected, we are now the voice of our communities in this forum. We come into the House to make known the fears, concerns and aspirations of our constituents and to legislate accordingly. We communicate on their behalf the policies they want addressed. In putting forward the views of our constituents, we make known the needs of the people to those who govern. In order to ensure that every Member is heard, this House must function smoothly and efficiently. Every Member is equal, irrespective of their political persuasion, political party or grouping. Every Member has a mandate and no one mandate is more important than the other. If elected as Ceann Comhairle, I will uphold these simple principles.",
                "Much debate has been heard regarding the turnout in the recent election. In many constituencies the turnout dropped below 50%. Large numbers of people in the electorate feel alienated from the political process. They feel that politicians are removed from the reality of day-to-day life. They feel that this Chamber is a talking shop that achieves nothing. It is incumbent on all of us to change that perception and to make the House more relevant to those who feel excluded. If elected, I want to engage with all Members to explore the options available to us to reform the way we conduct our business so that ordinary people feel their voices are being heard. The constituents who elected us have a right to see a fair and transparent democracy in action every time they observe our parliamentary debates and legislative work.",
                "In the previous Dáil I served as sub-chair and deputised for the Ceann Comhairle. In that regard, I believe I carried out my duties with respect and impartiality.",
                "Generally, my time in the Chair passed without incident, with the exception of the day a certain Kerry TD decided to serenade me with a poor rendition of a Cork song — figure that. At least his phone was turned off. I believe this experience has prepared me for the position.",
                "If the House chooses to elect me as the first female Ceann Comhairle in the State, it will signify a diverse, inclusive and forward-looking Thirty-fourth Dáil. If elected, I will execute the office of Ceann Comhairle of Dáil Éireann without fear or favour."
              ],
              "wordCount": 615
            },
            {
              "id": "spk_5",
              "speaker": null,
              "role": null,
              "recordedTime": "2024-12-18T11:00:00+00:00",
              "speakerLabel": "Cléireach na Dála",
              "paragraphs": [
                "Go raibh maith agat, a Theachta Murphy. I now call Deputy Seán Ó Fearghaíl."
              ],
              "wordCount": 14
            },
            {
              "id": "spk_6",
              "speaker": {
                "id": "SeanOFearghaillFF",
                "name": "Seán Ó Fearghaíl",
                "uri": "/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T11:00:00+00:00",
              "speakerLabel": "Deputy Seán Ó Fearghaíl",
              "paragraphs": [
                "Politics is never boring, anyway. It is a very long time since I have had the opportunity to address the House from up here. I spent many years on these backbenches. The place looks a lot different when viewed from here than from the Chair below, where I sat for a while.",
                "A Chléirigh na Dála agus mo chomhghleacaithe, is breá liom an deis seo a fháil cúpla focal a rá roimh an toghchán tábhachtach atá ag teacht. Gabhaim buíochas leis an mbeirt a d’oibrigh liom sa Dara Dáil is Tríocha agus sa Tríú Dáil is Tríocha mar Leas-Chinn Chomhairle, is iad sin Pat the Cope agus Catherine Connolly. D'oibrigh an bheirt acu go dian dícheallach agus, gan amhras, is daoine ionraic, macánta iad. Is beirt iad a bhfuil fealsúnacht acu atá bunaithe go hiomlán ar sheirbhís phoiblí.",
                "Today, I address the House with immense pride and appreciation of having had the privilege of serving as Ceann Comhairle of the Dáil. A little over eight years ago, I stood before this House as a candidate in the first ever secret ballot for a truly impartial and independent Chair. At the time, I spoke of the need to respect all Members equally and to work on behalf of the Parliament every day to protect and promote the Dáil as a vital institution in Irish life. That has always been my objective, undertaken in a manner that was, I hope, respectful and inclusive, regardless of political differences, working closely with Members from all sides.",
                "Together we have achieved a great deal, including a newly established Business Committee that gives every party and group an input into the work programme; a new and independent Parliamentary Budget Office, which advises us on the outcomes of public expenditure and the cost of proposals that are put before the House; an enhanced Office of Parliamentary Legal Advisers, which gives, in particular, to backbenchers of the Government and of the Opposition the chance, resources and support to be legislators in a way that was never possible previously; and annual parliamentary symposiums on the pressing topics of the day, such as mental health, forums on a family-friendly and inclusive Parliament, parliamentary privilege, and safe participation in public life. The work we have done has shown that when we choose to work together with a respectful and collaborative approach, we can and will succeed.",
                "I always intended to stand down after two terms as Ceann Comhairle, but in the final days of the previous Dáil, people from across the political spectrum, for whom I have great personal respect and admiration, began to approach me. They asked me to consider standing again to provide continuity and stability and to play a significant role in smoothing the transition from the Thirty-third to the Thirty-fourth Dáil. After careful reflection, I decided to put myself forward. I am wondering today if that was such a good idea after all. My candidacy on this occasion is time-limited and has a particular focus. As we sit here today, we have 75 Members of the House who did not sit in the previous Dáil. My aim is to ensure we support them to settle quickly into parliamentary life and become effective parliamentarians who represent their constituencies and their country to the very best of their considerable abilities.",
                "The process of Dáil reform, which I have already referenced, is not yet complete and, crucially, within the next two years, we have an opportunity not only to safeguard the reforms we have made but to build on them and enshrine the primacy of the Dáil as the true centre of Irish political life on the domestic and international stages. There are many challenges facing this House on which we must take a lead. It is within our power to address the critical issues of the day, to build on the progress in housing, to continue with the development of our health and education sectors, to take the necessary initiatives to strengthen and forge new relationships with the incoming Trump Administration, which has so much potential to impact us, and to address collectively on behalf of our people the murderous regimes of Putin, Netanyahu and other dictators, while keeping a careful eye on the significant shifts in the political landscape in many of our European neighbours. As we look to the North, I am particularly proud to have reactivated the North-South Inter-Parliamentary Association, which, as envisaged in the Good Friday Agreement, has the potential to build ever-stronger North-South relations on this island.",
                "Within the lifetime of this Dáil, we have an opportunity to build a new Ireland based on mutual understanding and respect. All of us in this House relish that challenge and the opportunity it presents. As regards the body politic itself, all too often people looking in at us here in Leinster House do not feel engaged in our political system or processes. At times they are frustrated and feel disenfranchised. It is up to us to change that. Forty per cent of our people did not vote in the general election. We must aim to include and not exclude; to engage and not isolate. To change this, we need to come together and overcome what are very often relatively minor difficulties between us.",
                "Colleagues, today the House faces a difficult choice. In Aengus, Verona and John, you have three other candidates for whom I have the height of respect, having worked with each of them for many years. I acknowledge their calibre, ability, commitment and contribution to Irish political life, and the visions they have today set out.",
                "Those of you who know and have worked with me in the past know what I stand for and how I will work. To those of you I have not yet had the privilege of working with, I make the same promise I made when I first stood for this office. I pledge to be resolute, to provide steadfast support for you, to work for you each day, to treat you all with equal respect and dignity, and to ensure your voices are heard. As far as the new Members are concerned, theirs are voices for change and I will ensure they are heard in this new Dáil. Together we can continue to work and strive to make this Parliament the best possible version of itself and to ensure it is worthy of the trust and respect of the great Irish people who have sent us here to serve."
              ],
              "wordCount": 1081
            },
            {
              "id": "spk_7",
              "speaker": null,
              "role": null,
              "recordedTime": "2024-12-18T11:00:00+00:00",
              "speakerLabel": "Cléireach na Dála",
              "paragraphs": [
                "Go raibh míle maith agat, a Theachta Ó Fearghaíl. I now call Deputy Aengus Ó Snodaigh."
              ],
              "wordCount": 16
            },
            {
              "id": "spk_8",
              "speaker": {
                "id": "AengusOSnodaighSF",
                "name": "Aengus Ó Snodaigh",
                "uri": "/ie/oireachtas/member/id/Aengus-Ó-Snodaigh.D.2002-06-06"
              },
              "role": null,
              "recordedTime": "2024-12-18T11:00:00+00:00",
              "speakerLabel": "Deputy Aengus Ó Snodaigh",
              "paragraphs": [
                "Gabhaim buíochas go háirithe leo siúd a chaith vóta dom sa toghchán is déanaí agus a thug an deis dom teacht ar ais go dtí an Dáil don séú huair mar Theachta Dála do Bhaile Átha Cliath Lár Theas. Mo bhuíochas le mo bhean agus mo chlann, na tacadóirí agus iad siúd a chaith vóta ar mo shon le linn an toghcháin sin. Ní sin an fáth a bhfuil mé ag seasamh os bhur gcomhair, áfach, ach ag lorg bhur vóta sa toghchán atá romhainn.",
                "Tá bród orm seasamh anseo ainmnithe ag mo pháirtí chun dul san iomaíocht le bheith mar Cheann Comhairle ar an gCeathrú Dáil is Tríocha. Smaoiním, agus mé ag seasamh anseo, ar an gcéad Cheann Comhairle ar an gCéad Dáil, Cathal Brugha, agus an lá cinniúnach a bhí ann nuair a léigh sé an \"Fhaisnéis Neamhspleádhchuis\" thar ceann na Dála agus an náisiúin. Rinne sé é sin as Gaeilge ar dtús báire. Tá an Ghaeilge an-tábhachtach dom, don náisiún agus don fhóram seo, an Dáil. Is í ár dteanga náisiúnta í agus príomhtheanga oifigiúil an Stáit de réir Bhunreacht na hÉireann. Tá sé tábhachtach go mbeadh Teachta ar bith in ann an Ghaeilge a úsáid agus a labhairt agus muinín acu go ndéanfaidh Ceann Comhairle an lae an ceart sin a chosaint agus na rialacha a chur i bhfeidhm ar chomhchéim leo siúd a bheidh ag labhairt as Béarla. Tá sé tábhachtach go léiríonn an Ceann Comhairle ceannaireacht chun an Ghaeilge a chur chun cinn sa Teach seo agus lasmuigh, más féidir.",
                "Gabhaim buíochas leis an Teachta Seán Ó Fearghaíl as na hocht mbliana a chaith sé ag tabhairt faoin dualgas sa ról sin, áit ar chuir sé an Ghaeilge chun cinn i gcónaí. Guím gach rath air agus ar na hiarrthóirí eile atá ag lorg an phoist seo inniu. Seo ceann de na deiseanna atá ag Teachtaí Dála aonaracha seasamh a ghlacadh chun a chinntiú go mbeidh an Dáil seo neamhspleách ar an Rialtas. Tá scileanna ar leith de dhíth chun an post seo a chomhlíonadh i gceart.",
                "There are key skills for the Teachta Dála who is to be entrusted with the position of Ceann Comhairle, the 20th Ceann Comhairle since Cathal Brugha opened the Chéad Dáil as Gaeilge 105 years ago. He or she should have those skills. As I mentioned as Gaeilge, in a bilingual House with two official languages we need a Chair who can monitor and, if necessary, step in and apply the rules and protections of this House equally to everyone, whether it be as Gaeilge nó as Béarla. The first official language of the State is Irish. The Irish text of our Constitution and the laws trumps the English versions for legal purposes. The most senior officer in this House should be competent in that language and be able to guide and assist others with the language too.",
                "Every Teachta Dála deserves a Ceann Comhairle who knows and understands the Standing Orders and procedures well enough to vindicate their rights from the get-go. Most importantly, the Ceann Comhairle must be an impartial Chair who, rather than seeking the limelight for himself or herself, facilitates Members across the House coming together in a constructive manner, in the best interests of all the people. He or she must unquestionably be independent of government. This is vital to ensure the primacy of the Dáil and your rights as a Teachta Dála, whether as a Government backbencher or Opposition TD, to hold Ministers accountable, defend the interests of your constituents and ensure the public trust in our democratic institutions and the checks and balances.",
                "As a parliamentarian, you are being asked to choose the person you think best suited to hold this high office, which is not in the gift of the Taoiseach of the day. There are people in this room who are diametrically opposed to what I believe in. We have been together, though, on parliamentary delegations, representing what is best for Ireland. We have been on Oireachtas committees, working together for the best outcomes, or in this Chamber, on opposite sides of the argument, but we are still friends, so much so that I cheekily reached out to some of those on the opposite benches looking for a vote. I hope, given that it is a secret ballot, that many will cast a vote my way today.",
                "It is important that we have a Ceann Comhairle who reminds us to have regard for each other. We are all humans with families and feelings. We need to respect each other, respect the mandate each and every one of us in this room has to represent the people and respect the fact that we are legislators. We might not always agree and we can be boisterous in this Chamber, but there is no need to be hurtful or downright hateful. We can have, and have had, a long parliamentary tradition of debate and disagreement in a civil way. Our committee system in this Oireachtas shows that we can work together for the betterment of all.",
                "I believe I have demonstrated my abilities in chairing the Dáil on many occasions in the last Dáil and in chairing Oireachtas committees over the last number of Dáileanna. My membership of parliamentary friendship groups and the British-Irish Parliamentary Assembly demonstrates my ability to be fair to all, to listen, to give everyone time to develop their point and to implement the rules with no favour. I have been a member of the Committee on Standing Orders and Dáil Reform and the Committee on Procedure and Privilege, now called the committee on parliamentary oversight. I have been a whip in this House for 18 of the more than 22 years that I have been here. I have been on both those committees for more than 22 years. I have been on many other committees in this House. I have demonstrated and learned in those times the respect for parliamentary procedures and also respect for each and every one who is sitting here in front of me, and those who were not elected and have left this Chamber on this occasion.",
                "I ask you today, when casting your vote, to ask yourself who will stand up for the primacy of this House. Go raibh maith agaibh."
              ],
              "wordCount": 1049
            },
            {
              "id": "spk_9",
              "speaker": null,
              "role": null,
              "recordedTime": "2024-12-18T11:10:00+00:00",
              "speakerLabel": "Cléireach na Dála",
              "paragraphs": [
                "Go raibh maith agat, a Theachta Ó Snodaigh. That concludes the contributions from the candidates. We will now ring the bells for six minutes, and when they stop we will proceed to the secret ballot. When the bells have stopped, all of the doors into the Chamber, except for the two on either side of the Ceann Comhairle's chair, will be locked. I would ask all Members to retake their seats when the bells have stopped.",
                "I now ask the ushers to lock the doors, except for the two on either side of the Ceann Comhairle’s chair, which will remain open. The ushers will shortly direct Members to proceed to the voting lobby at the back of the Chamber to cast their ballots. I ask that Members remain in their seats until directed by the ushers. Before the voting begins, I call on the Captain of the Guard and Head Usher to confirm that the ballot boxes, which are to my left and right in the voting lobby, are empty.",
                "The ballot boxes are empty. We are now ready to start the ballot. Voting will proceed, row by row, starting with the first row to my left, and moving to the right, as directed by the ushers. In order to reach the voting lobby, Members should use the central staircase immediately in front of me. For health and safety reasons, I must ask Members not to queue on the staircase, as the stairs are very steep. The ushers will direct you to ascend when the staircase is clear. When directed to do so, please proceed by the central staircase to be issued with your ballot paper. Officials in the voting lobby will ask you to confirm your name. They will cross your name off the register and issue you with a stamped and embossed ballot paper. There are eight voting booths in total; four each on the left and right at the top of the stairs. Members with surnames beginning A to H should go to the left at the top of the stairs and members with surnames beginning I to Z should go to the right. The ballot will be counted under the proportional representation single transferable vote, PRSTV, system. Accordingly, you may number the candidates in the order of your choice.",
                "If you inadvertently spoil your ballot paper, you should present it to me. I will inspect the ballot paper and may decide to allow a replacement paper to be issued. In such cases, I will retain the original ballot paper and issue a certificate in order that another ballot paper can be issued from the officials in the division lobby.",
                "When you have finished casting your vote, please come back to the floor of the House via the side stairs to my right and left. You may either resume your seats or leave by way of the doors behind me."
              ],
              "wordCount": 483
            },
            {
              "id": "spk_10",
              "speaker": null,
              "role": null,
              "recordedTime": "2024-12-18T11:50:00+00:00",
              "speakerLabel": "Cléireach na Dála",
              "paragraphs": [
                "In my opinion, all Members intending to vote have now cast their ballots. The ballot is concluded and the votes will now be counted. The counting of votes will take place in the Seanad anteroom, which is open to everyone who wishes to attend, space permitting. We will start the count at 12.15 p.m.",
                "The sitting is now suspended until 3.30 p.m."
              ],
              "wordCount": 62
            },
            {
              "id": "spk_11",
              "speaker": null,
              "role": null,
              "recordedTime": "2024-12-18T15:30:00+00:00",
              "speakerLabel": "Cléireach na Dála",
              "paragraphs": [
                "In accordance with Standing Order 7(3), I inform the House that Deputy Verona Murphy is the successful candidate selected by the secret ballot for the position of Ceann Comhairle. I now put the question that Deputy Verona Murphy, who is the successful candidate duly selected by secret ballot by the Members of Dáil Éireann, be elected and do now take the Chair of the Dáil as Ceann Comhairle."
              ],
              "wordCount": 68
            },
            {
              "id": "spk_12",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:30:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "I am humbled, honoured and privileged to serve as Ceann Comhairle of this great State. When it was first proposed to me by Deputy Michael Lowry if I would consider a nomination from the group as Ceann Comhairle, my initial thought was how it would affect my ability to represent the people of Wexford, and whether he was serious at all. Having consulted with my team and supporters, however, they gave me a resounding endorsement and insisted I pursue the nomination. To the people of Wexford, I want to say my office is open and normal service resumes after the Christmas holidays and will be maintained and improved. To my colleagues in the Regional Group, it was a pleasure to be part of it. I thank my colleagues here today for their support. I undertake to be fair and impartial, to be even-handed and even-tempered in the Chair. To the general public, I hope to be a reforming Ceann Comhairle, like my predecessor, and make the operations of the House more relevant in terms of the way it affects people day to day. I take on board the comments today and I undertake to improve my Irish to a level that is commensurate with the office I now hold. To my staff in Wexford, I say a huge \"Thank you\" for all your hard work. To my family here present, I say a huge \"Thank you\" for your support, which has been unrelenting. I thank the Clerk of the Dáil, Mr. Peter Finnegan, and the staff of the Houses. I also thank the staff in the catering service of the Houses, which is a very important aspect of the job, and we are looked after to a very high standard. I wish to thank everybody sincerely and now get on with the proceedings of the day.",
                "I call the Taoiseach, Deputy Simon Harris, to make a short statement."
              ],
              "wordCount": 318
            },
            {
              "id": "spk_13",
              "speaker": {
                "id": "SimonHarris",
                "name": "Simon Harris",
                "uri": "/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:30:00+00:00",
              "speakerLabel": "The Taoiseach",
              "paragraphs": [
                "Thank you very much, a Cheann Comhairle. I will start by congratulating you on your election. It is a great honour to serve as Ceann Comhairle of Dáil Éireann, as the Speaker of our Parliament and as custodian of this House. I know you will serve with diligence, impartiality and decency. I think we know you are from Wexford from those opening contributions, and I know that is very important to you too. I join with you in thanking the outgoing Ceann Comhairle, Seán Ó Fearghaíl, who served for eight years with absolute distinction and brought a great sense of pride to all of us in the Houses."
              ],
              "wordCount": 108
            },
            {
              "id": "spk_14",
              "speaker": null,
              "role": null,
              "recordedTime": "2024-12-18T15:30:00+00:00",
              "speakerLabel": "Deputies",
              "paragraphs": [
                "Hear, hear."
              ],
              "wordCount": 2
            },
            {
              "id": "spk_15",
              "speaker": {
                "id": "SimonHarris",
                "name": "Simon Harris",
                "uri": "/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:30:00+00:00",
              "speakerLabel": "The Taoiseach",
              "paragraphs": [
                "It is not lost on any of us that Deputy Murphy makes history today by becoming the first female Ceann Comhairle. That is a long-awaited milestone moment in Irish politics. I sincerely wish you all the best as you discharge your duties.",
                "Colleagues, as we gather here today, I want to pay tribute to each of you for securing the support of your families, friends, neighbours and constituents and for securing your own individual mandate to serve in this, the Thirty-fourth Dáil. I particularly pay tribute to all 64 of our new TDs, including 23 from within my own Fine Gael Party, who take their seats here for the first time today. This is a moment none of us ever forgets - the moment we for the first time take our seats in this House. I know it is a source of immense pride for you and your families. It is the greatest honour to serve as a representative of your community. I genuinely wish each and every one of you the most fulfilling experience here in Leinster House.",
                "If I can offer any advice, it is for all of us to remember that we are but temporary custodians of our positions. We are here to serve the people who vote for us and the people who do not. Please do enjoy today. Celebrate this moment with those who support you, who knocked on doors for you, who canvassed for you. To all those who have been re-elected to this House, I offer my sincerest congratulations, as well as to all those who worked so hard for you. While we may differ across this House on policies and politics, every single person in this House is democratically elected and each of us takes our rightful place as a Teachta Dála today. I hope we can find common ground to work together on the issues that matter most to people and that, where we differ, we can engage in respectful debate and set that tone for the Thirty-fourth Dáil, starting here today. I acknowledge and thank all those who ran in the election and were not successfully elected to this House. Today is a difficult day for them and we think of all of them as well. I particularly pay tribute to the 18 Fine Gael TDs who retired at the last election.",
                "A Cheann Comhairle, as Deputies are aware, discussions are ongoing among parties and individual Members of this House on the formation of a new Government following the general election. It is very clear to all that those discussions are ongoing and it will take some time more for them to be completed. Therefore, it is unlikely that there will be a new Taoiseach elected or a new Government formed today. For that reason, I do not propose that my party will make a nomination for Taoiseach today. In accordance with the precedent set in 1989 and followed thereafter, I informed President Higgins this morning of my resignation as Taoiseach and that of the Government. In accordance with Article 28.11 of the Constitution, I will continue as Taoiseach until a successor has been appointed and likewise all members of the Government and the Government as a whole will continue to carry out its duties until a new Government has been appointed and elected by this House, too.",
                "I want to reassure people that Government will continue to function and will work for people and in their interests while the work is ongoing to form a new Government. In that vein, I will be travelling later this afternoon to Brussels for this evening's meeting of the EU-Western Balkans summit followed by a meeting of the European Council on Thursday, where I will take an opportunity to discuss many pressing matters. I will do so after an election campaign where we heard clearly from our people that they wish to see a stable Government with a fresh focus on deliveries that matter to them. We all heard across this House about the cost-of-living crisis remaining real in the lives of many and that much needs to be done to support small businesses at a time when the protection of our economy must continue to be paramount. We heard clearly from people that there needs to be a step change in the delivery of disability services, particularly children's disability services and special education. We heard clearly about law and order needing to prevail and people wanting to feel safer on our streets. We know that we must all work together to make much more progress on the greatest challenge, that of the delivery of housing and the key infrastructure needed to support it and to ensure we continue our prosperity as a nation. We know the geopolitical challenges that we face, a Cheann Comhairle, and which will require a strong, stable Government with a coherent programme and a fiscal and budgetary strategy to be able to help those who need it in the here and now and invest in longer-term services and infrastructure. I want to thank everybody who has worked so hard in the outgoing Government for all of the work they have done in many areas. I am proud of much of the work that has been achieved. There will be time for that on another day.",
                "As we head towards Christmas and the new year, I know that many people in this House will be thinking of those much less fortunate in war-torn parts of our continent who are suffering horrifically in ongoing conflicts. When I travel to Brussels this evening they will be foremost in my thoughts and in my engagements. I want to tell this House one thing with absolute certainty. No Government of any country, especially one which is engaging in the most amoral and brutal onslaught of innocent people and terrified children, will intimidate or silence anyone in this House or this Government when we seek to speak up for peace, human rights and respect for international law. A Cheann Comhairle, political debate in general and debate in this Dáil can often be characterised by division but on the issue of the war in Gaza and the suffering of the people there, I believe we are united. I am very proud that Ireland speaks with a strong voice and it is one which cries out for a ceasefire, for the release of all hostages, for the flowing of humanitarian aid and ultimately for the peaceful coexistence of Israel and Palestine as two states.",
                "Before I conclude today, I want to take this opportunity to wish everyone in this House well over the Christmas period. As I said earlier, we are temporary custodians of this House but the staff across Leinster House are the lifeblood of this place. To everyone who plays a role in the functioning of the Oireachtas, in the canteens, the restaurants, the bars, the ushers, the transcribers, the Clerk and all of the staff who work so hard, I want to wish you and your families a very happy Christmas. This has been a busy political year with three elections, a local, a European and a general election, a referendum, and leadership changes in many parties. It is time at the Christmas period to take a breather and take a break. Let us come back with a view to electing a new Government with a clear mandate to deliver for the people."
              ],
              "wordCount": 1240
            },
            {
              "id": "spk_16",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:40:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "We will move to nominations for an Taoiseach, the next business item."
              ],
              "wordCount": 12
            },
            {
              "id": "spk_17",
              "speaker": {
                "id": "MaryLouMcDonald",
                "name": "Mary Lou McDonald",
                "uri": "/ie/oireachtas/member/id/Mary-Lou-McDonald.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:40:00+00:00",
              "speakerLabel": "Deputy Mary Lou McDonald",
              "paragraphs": [
                "Nach bhfuil seans ag na ceannairí eile cúpla focal a rá faoin gCeann Comhairle?"
              ],
              "wordCount": 14
            },
            {
              "id": "spk_18",
              "speaker": {
                "id": "PadraigMacLochlainn",
                "name": "Pádraig Mac Lochlainn",
                "uri": "/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:40:00+00:00",
              "speakerLabel": "Deputy Pádraig Mac Lochlainn",
              "paragraphs": [
                "Just to congratulate you."
              ],
              "wordCount": 4
            },
            {
              "id": "spk_19",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:40:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "Later, I would have thought. I will ask the Clerk."
              ],
              "wordCount": 10
            },
            {
              "id": "spk_20",
              "speaker": {
                "id": "MaryLouMcDonald",
                "name": "Mary Lou McDonald",
                "uri": "/ie/oireachtas/member/id/Mary-Lou-McDonald.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:40:00+00:00",
              "speakerLabel": "Deputy Mary Lou McDonald",
              "paragraphs": [
                "We should have been informed of that."
              ],
              "wordCount": 7
            },
            {
              "id": "spk_21",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:40:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "We will continue with the nomination. There is speaking time after that."
              ],
              "wordCount": 12
            },
            {
              "id": "spk_22",
              "speaker": {
                "id": "MaryLouMcDonald",
                "name": "Mary Lou McDonald",
                "uri": "/ie/oireachtas/member/id/Mary-Lou-McDonald.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:40:00+00:00",
              "speakerLabel": "Deputy Mary Lou McDonald",
              "paragraphs": [
                "I appreciate that but we should have been informed."
              ],
              "wordCount": 9
            }
          ],
          "subsections": [],
          "metadata": {
            "debateType": "debate",
            "counts": {
              "speakerCount": 8,
              "speechCount": 22
            },
            "containsDebate": true,
            "parentId": null
          }
        },
        {
          "id": "dbsect_8",
          "title": "Taoiseach a Ainmniú - Nomination of Taoiseach",
          "debateType": "debate",
          "recordedTime": "2024-12-18T15:40:00+00:00",
          "containsDebate": true,
          "question": null,
          "speeches": [
            {
              "id": "spk_23",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:40:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "The next business is the nomination of Taoiseach pursuant to Article 13.1.1° of the Constitution. I invite Members to make nominations for Taoiseach. I remind Members that it is custom to second nominations for Taoiseach but this is not mandatory."
              ],
              "wordCount": 40
            },
            {
              "id": "spk_24",
              "speaker": {
                "id": "PearseDoherty",
                "name": "Pearse Doherty",
                "uri": "/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:40:00+00:00",
              "speakerLabel": "Deputy Pearse Doherty",
              "paragraphs": [
                "Tairgim:",
                "Go n-ainmneoidh Dáil Éireann an Teachta Mary Lou McDonald chun a cheaptha ag an Uachtarán mar Thaoiseach.",
                "I move:",
                "That Dáil Éireann nominate Deputy Mary Lou McDonald for appointment by the President to be Taoiseach.",
                "Is mór an onóir agus an phribhléid dom an Teachta Mary Lou McDonald a ainmniú d’oifig an Taoisigh. Bheadh sí i gceannas ar rialtas do ghnáthdhaoine, gnáthoibrithe agus teaghlaigh, agus is í an ceannaire a bhfuil an fhís agus an diongbháilteacht aici todhchaí níos fearr a sholáthar d’Éirinn. It is my great honour, a Cheann Comhairle, to nominate uachtarán Shinn Féin, an Teachta Mary Lou McDonald, to the office of an Taoiseach. During the election, we said that Ireland needed a new Government and a new leadership for a better future, a new leadership with the vision, determination and political will to make a positive difference in the lives of ordinary workers, in families and communities, a new leadership with new ideas to meet the incredible opportunities and important challenges facing Ireland over the next decade. Mary Lou McDonald is that leader. She is a leader who is rooted in the Irish republican principles of fairness, equality, economic justice and unity of our country. The Government an Teachta McDonald would lead would be a Government of change, a new Government that would end the housing crisis and make housing affordable for working people, a Government that would transform our health services and end the wait for treatment, one that would introduce affordable childcare for families, ensure a better, fairer deal for ordinary workers and ensure that our young people can build a future and a life here in Ireland.",
                "We have had 100 years of Fianna Fáil and Fine Gael Governments. It is enough. The last thing we need is another Government that prioritises the wealth and privilege of those at the top. That is what we will get again, be there no doubt about it, if Deputies Micheál Martin and Simon Harris get their deal over the line. Make no mistake about it, a Cheann Comhairle, if this happens, as sure as night follows day we will be back in this Chamber in a number of years talking about the same problems, only worse again. It is time to turn the page, to reach with ambition for better, for a new Government for working people, a Government that will put reunification at the heart of its vision for the future. That is the Government Ireland needs and an Teachta Mary Lou McDonald is the person who can lead it. She is a leader of incredible strength, resilience and perseverance. The values of fairness, hard work, standing up for people and treating everyone with respect are at her core. We need that now more than ever. This is a time of generational change here in Ireland, a time of great opportunity. The leadership that defined the past cannot and will not achieve a better future. We need a Taoiseach with the courage to break with the merry-go-round of a century, a new Taoiseach and a new Government that will truly put workers, families and communities first, with the audacity and determination to take us to that further shore where opportunity, prosperity and hope are open to all our people. Mary Lou McDonald would be that Taoiseach. She would lead that new Government. I ask all Teachtaí here who want to achieve a better future to support the nomination of my friend and colleague, Mary Lou McDonald, for Taoiseach."
              ],
              "wordCount": 584
            },
            {
              "id": "spk_25",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:40:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "I call Deputy Joanna Byrne as seconder."
              ],
              "wordCount": 7
            },
            {
              "id": "spk_26",
              "speaker": {
                "id": "JoannaByrne",
                "name": "Joanna Byrne",
                "uri": "/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:40:00+00:00",
              "speakerLabel": "Deputy Joanna Byrne",
              "paragraphs": [
                "It is a great honour and privilege for me to be here to give my maiden speech representing the people of Louth and east Meath and my home town of Drogheda, the largest town in the country, which is a city by population, a city at heart and a city in all but name. With my Drogheda colleagues here in this Chamber, we will endeavour to make that happen. I cannot emphasise enough just how proud I am as a young republican woman to represent those people here today, people I grew up, went to school and worked with, people I have come to know through my various passions in my community.",
                "I stand here in the middle of an expanded Sinn Féin parliamentary team of 39 TDs, the largest number in a century. We are a mix of youth and experience, men and proud women, all with a common objective, hunger and desire to work for the people of Ireland in every corner of Ireland and in every townland, village, town, city and city-to-be. We were elected as a result of a campaign of hope and positive change and our task, and my task now, is to ensure from today, day one, that we do our utmost to deliver that. That positive change is what all the people of Louth, east Meath and Ireland deserve.",
                "Not long ago, I could not have imagined that in my maiden speech, I would have the opportunity I have now, namely, the privilege and great honour to second the nomination of Deputy Mary Lou McDonald for Taoiseach. Mary Lou is the leader this country needs. She is a formidable force and the leader who will tackle the Government's waste of public moneys and the many crises we face as a nation, such as housing, health and the cost of living among others, all cemented in legacies created by previous Governments' policies. She is a leader who unites people and she is the leader who will pave a pathway towards a united Ireland. She understands the needs of the people of Ireland in every corner of our island.",
                "As a young woman who prides herself on breaking down barriers for women in worlds traditionally dominated by men, I have been inspired by Mary Lou for similar reasons over many years. Her charisma, empathy and adaptable manner have made her a champion of the people and a true champion of communities the length and breadth of our country and in all walks of life. The low turnout in the election shows there is a widening disconnect between this House and the disenfranchised people of Ireland. That disconnect needs to be tackled now, and anyone anywhere who has ever witnessed Mary Lou McDonald engaging with the public, always with a smile and a listening ear, knows she is the one to end that disconnect and to hear the needs of the people.",
                "A definition of insanity is doing the same thing over and over and expecting different results, and that is what will happen if we have another Fianna Fáil or Fine Gael Taoiseach. To deliver the platform of change that people are desperately crying out for, we need Deputy Mary Lou McDonald at the helm. We need Taoiseach Mary Lou McDonald. I commend the motion to the House."
              ],
              "wordCount": 553
            },
            {
              "id": "spk_27",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "As there are no other nominations, I call the Tánaiste, Deputy Micheál Martin, to respond to the motion."
              ],
              "wordCount": 18
            },
            {
              "id": "spk_28",
              "speaker": {
                "id": "MichaelMartin",
                "name": "Micheál Martin",
                "uri": "/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
              },
              "role": {
                "id": "Minister_for_Foreign_Affairs",
                "name": "Minister for Foreign Affairs",
                "uri": "/ie/oireachtas/role/minister/foreign_affairs"
              },
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "Minister for Foreign Affairs (Deputy Micheál Martin)",
              "paragraphs": [
                "I dtús báire, a Cheann Comhairle, ba mhaith liom mo bhuíochas a ghabháil leatsa as a bheith tofa mar Cheann Comhairle. Lá stairiúil é gan dabht. Is tusa an chéad bhean a bheith ina Ceann Comhairle. Guím gach rath ort mar Cheann Comhairle agus táim sásta a rá go mbeidh mé féin agus muid i bpáirtí Fhianna Fáil lánsásta comhoibriú a dhéanamh leat. It is a great honour for you, a Cheann Comhairle, to have been elected as the first woman Ceann Comhairle. It is an historic day. I assure her of our co-operation as a party for the next five years. She will have the co-operation of all of us in that regard.",
                "I also take the opportunity to wish the outgoing Ceann Comhairle, Deputy Ó Fearghaíl, our sincere gratitude and thanks for his outstanding service to the nation as a most distinguished Ceann Comhairle who operated with tremendous dignity and who added great dignity to the office of Ceann Comhairle during his terms. Anybody who was in Dáil Éireann both before 2016 and since 2016 could not but be struck by the tremendous reform that took place under Deputy Ó Fearghaíl as Ceann Comhairle. A far greater resource is now available as a result of the reform package of 2016 and its aftermath, the Parliamentary Budget Office being one aspect. There are now tremendous resources to facilitate research into policy and greater resources all round for Members. Moreover, every Member is treated with equal respect across the aisle of the House, and I thank the outgoing Ceann Comhairle for that.",
                "In respect of the motion and nomination before us, one of the things that most encourages cynicism about politics is when our time is wasted on empty gestures and grandstanding. There is no better way to describe the decision by Sinn Féin to propose its leader for the position of Taoiseach today. I think we all know that no one has the support yet to be elected as Taoiseach today. There is no new Government available yet. Not one Deputy will change his or her mind based on a vote being called today. After the previous election, Sinn Féin argued that the party that had received the largest vote should lead the Government. That was the position after 2020, so if the party were being consistent, it would be in the process of nominating me today."
              ],
              "wordCount": 398
            },
            {
              "id": "spk_29",
              "speaker": {
                "id": "MichaelMartin",
                "name": "Micheál Martin",
                "uri": "/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
              },
              "role": {
                "id": "Minister_for_Foreign_Affairs",
                "name": "Minister for Foreign Affairs",
                "uri": "/ie/oireachtas/role/minister/foreign_affairs"
              },
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "Deputy Micheál Martin",
              "paragraphs": [
                "Of course, Sinn Féin continues to make things up as it goes along. Sinn Féin knows it lost significant support in the election. It knows it came third in the popular vote. It knows there is zero legitimacy for its demand that everyone else in this House stay quiet and give it power."
              ],
              "wordCount": 53
            },
            {
              "id": "spk_30",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "I thank the Tánaiste."
              ],
              "wordCount": 4
            },
            {
              "id": "spk_31",
              "speaker": {
                "id": "MichaelMartin",
                "name": "Micheál Martin",
                "uri": "/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
              },
              "role": {
                "id": "Minister_for_Foreign_Affairs",
                "name": "Minister for Foreign Affairs",
                "uri": "/ie/oireachtas/role/minister/foreign_affairs"
              },
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "Deputy Micheál Martin",
              "paragraphs": [
                "Deputy McDonald knows she made her case for radical change in government during the election."
              ],
              "wordCount": 15
            },
            {
              "id": "spk_32",
              "speaker": {
                "id": "MattCarthy",
                "name": "Matt Carthy",
                "uri": "/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "Deputy Matt Carthy",
              "paragraphs": [
                "Time is up, Micheál."
              ],
              "wordCount": 4
            },
            {
              "id": "spk_33",
              "speaker": {
                "id": "MichaelMartin",
                "name": "Micheál Martin",
                "uri": "/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
              },
              "role": {
                "id": "Minister_for_Foreign_Affairs",
                "name": "Minister for Foreign Affairs",
                "uri": "/ie/oireachtas/role/minister/foreign_affairs"
              },
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "Deputy Micheál Martin",
              "paragraphs": [
                "She participated in the debates-----"
              ],
              "wordCount": 5
            },
            {
              "id": "spk_34",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "I thank the Tánaiste. I will start as I mean to go on."
              ],
              "wordCount": 13
            },
            {
              "id": "spk_35",
              "speaker": {
                "id": "MichaelMartin",
                "name": "Micheál Martin",
                "uri": "/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
              },
              "role": {
                "id": "Minister_for_Foreign_Affairs",
                "name": "Minister for Foreign Affairs",
                "uri": "/ie/oireachtas/role/minister/foreign_affairs"
              },
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "Deputy Micheál Martin",
              "paragraphs": [
                "-----and her party was fully heard throughout the media. I think we all well know-----"
              ],
              "wordCount": 15
            },
            {
              "id": "spk_36",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "I thank the Tánaiste. We will move on."
              ],
              "wordCount": 8
            },
            {
              "id": "spk_37",
              "speaker": {
                "id": "MichaelMartin",
                "name": "Micheál Martin",
                "uri": "/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
              },
              "role": {
                "id": "Minister_for_Foreign_Affairs",
                "name": "Minister for Foreign Affairs",
                "uri": "/ie/oireachtas/role/minister/foreign_affairs"
              },
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "Deputy Micheál Martin",
              "paragraphs": [
                "-----that breaking out the flags and celebrating an exit poll is more than a bit premature."
              ],
              "wordCount": 16
            },
            {
              "id": "spk_38",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "I thank the Tánaiste. We move now to the leader of the Labour Party, Deputy Ivana Bacik."
              ],
              "wordCount": 17
            },
            {
              "id": "spk_39",
              "speaker": {
                "id": "IvanaBacik",
                "name": "Ivana Bacik",
                "uri": "/ie/oireachtas/member/id/Ivana-Bacik.S.2007-07-23"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "Deputy Ivana Bacik",
              "paragraphs": [
                "Go raibh maith agat, a Cheann Comhairle, and congratulations on your election to your new role. Like others, I wish to pay tribute to the outgoing Ceann Comhairle, Deputy Ó Fearghaíl, for his work and his commitment to the reform of procedures in the House. We look forward to working with you.",
                "It is good to be back, and I think all of us in this Chamber share that sentiment. It is particularly good for me, as leader of the Labour Party, to lead a newly enlarged party and a group of 11-strong Labour Party TDs, all of us committed to making the changes over the course of this Dáil term that our communities so badly need. Whoever is ultimately elected Taoiseach, and there may indeed be no successful election today notwithstanding the motion from Sinn Féin, all of our energies must be focused on delivering the change our communities need. I thank all those who put their trust and faith in the Labour Party and our elected Deputies to bring about that change.",
                "As I said, whoever is elected Taoiseach, whatever the shape of the new Government, we have to work to secure the change. It is about the communities we serve. It is about those families who are facing eviction over Christmas. We know that 4,500 children are homeless, which is shameful in a State that is running budget surpluses. It is about the families who cannot access additional needs places for their children, and we all know about that huge issue across the country. It is about the parents struggling to find childcare when their child's crèche closes. It is about young adults booking one-way tickets to Australia because they see no future for themselves here and no prospect of owning an affordable home. We owe it to communities who are suffering and who are disadvantaged by current policies. We owe it to those communities to bring about a vision of an active State that can deliver change. That is the programme we stood for as the Labour Party, and it is the programme we will be working to achieve, whether in government or in opposition, over the course of this Dáil.",
                "We are faced with a motion on the election of a Taoiseach but whoever is elected Taoiseach, we must all work together, constructively, to achieve the change that communities need. We are all aware of the housing crisis, the civil rights issue of this generation. We are all aware of creaking public services, of healthcare delays, of chronic staffing shortages across our schools and hospitals. We are aware of the existential threat posed by climate change and the urgent actions that are necessary over the course of the next five years to tackle that. We are also aware of the terrible geopolitical events, such as the awful carnage in Gaza and the ongoing war being waged by Russia in Ukraine. We are aware of these enormous challenges and we must work constructively to address them and to serve the communities we are proud to represent."
              ],
              "wordCount": 510
            },
            {
              "id": "spk_40",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "I thank the Deputy. We now move to the deputy leader of the Social Democrats, Deputy Cian O'Callaghan."
              ],
              "wordCount": 18
            },
            {
              "id": "spk_41",
              "speaker": {
                "id": "CianOCallaghan",
                "name": "Cian O'Callaghan",
                "uri": "/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "Deputy Cian O'Callaghan",
              "paragraphs": [
                "I congratulate the Ceann Comhairle on having been elected but I think Deputy Hearne is taking this slot for us."
              ],
              "wordCount": 20
            },
            {
              "id": "spk_42",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T15:50:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "Apologies, I was not aware. That is no problem, I call Deputy Hearne."
              ],
              "wordCount": 13
            },
            {
              "id": "spk_43",
              "speaker": {
                "id": "RoryHearne",
                "name": "Rory Hearne",
                "uri": "/ie/oireachtas/member/id/Rory-Hearne.D.2024-11-29"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Rory Hearne",
              "paragraphs": [
                "Comhghairdeas, a Cheann Comhairle, agus go raibh maith agat. I am delighted to speak today. Is onóir é inniu labhairt mar ghuth do mhuintir Dublin North-West agus ba mhaith liom buíochas a ghabháil leo. I also want to thank my family, the Social Democrats and Róisín Shortall for their support.",
                "As we are discussing who will be the next Taoiseach, the Social Democrats would like us to look at and go back to the programme of the First Dáil in 1919, which stated:",
                "It shall be the first duty of the Government of the Republic to make provision … that no child shall suffer hunger or cold from lack of food, clothing, or shelter…",
                "Yet today, as we heard at the doors during the election, in my own constituency of Dublin North-West and across this country there are 230,000 children growing up in poverty in families that cannot afford to heat their homes, pay for social activities or keep food on the table or a roof over their heads. One of the basic needs of a child's well-being is a secure home yet this Christmas, shamefully, there will be 4,645 children and their families, and possibly more, in emergency accommodation, not in a home.",
                "Today in this country, despite unprecedented wealth, there are thousands waiting to access vital assessment and intervention services for their children with additional needs and, of course, we have a generation locked out of home ownership. Record house prices and record rents have resulted in 500,000 adults stuck living in their childhood bedrooms, while others are stuck renting in insecure and unaffordable housing. Despite the resources and despite the wealth, they see no future in this country - no way to get a home of their own or start independent adult lives. Many are emigrating because of the housing failure.",
                "This housing emergency is the defining issue of our time. We need to see an urgent response in scale and effort that will deliver genuinely affordable housing. We need to stop treating housing as an investment asset for the vulture funds and corporate landlords. We need to treat housing as a home and as a human right. The housing disaster can be solved. We in the Social Democrats have put forward policies that can achieve this. We can look to our past, which shows that we can build social and affordable housing at a major scale. We can end homelessness. These social crises are not inevitable. They result from political choices about the type of economic and social policies that we have. Successive governments have chosen to put private and market interests ahead of the common good. We remain an unfinished republic. In order to achieve the Ireland that cherishes all equally, we in the Social Democrats have set out new political choices and new policies that will use the resources and wealth in this country to ensure that we build affordable homes, that no child is homeless and that we provide public services. Is féidir linn."
              ],
              "wordCount": 501
            },
            {
              "id": "spk_44",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "We move to a representative of the regional technical group convened by Deputy Michael Lowry."
              ],
              "wordCount": 15
            },
            {
              "id": "spk_45",
              "speaker": {
                "id": "MichaelLowry",
                "name": "Michael Lowry",
                "uri": "/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Michael Lowry",
              "paragraphs": [
                "Last night Verona was relaxed, this morning she was a nervous Deputy and she is now Ceann Comhairle, so it was quite a good transition overnight. I congratulate her on her elevation to the distinguished position of Chair of Dáil Éireann. Her election is a welcome and historic milestone event. In putting her name forward for nomination, my colleagues in the Regional Group had every confidence in her ability to be fair, impartial and impressive in the conduct of her role. It is a singular personal honour. Her family, friends and supporters and the people of Wexford will reflect and bask in the glory of her achievement. We wish her every success.",
                "I thank the outgoing Ceann Comhairle, Deputy Seán Ó Fearghaíl, for his impeccable conduct of Dáil business in his period as Ceann Comhairle. I thank him for the courtesy and kindness that he extended to all Members of this House, in particular the members of our regional group.",
                "In relation to the nomination before us, I think it is premature to talk about the appointment of a Taoiseach. The people have spoken through the ballot box. As privileged Members of the Thirty-fourth Dáil, we now have the responsibility to form a government. The people we represent want us to move forward. They want us to elect a strong, stable government - a government that has the cohesion to last a full term of five years and a government that is capable of confronting and dealing with the many challenges that lie ahead. Our regional group will approach the formation talks in a positive and constructive manner and, hopefully, the people of Ireland will have a new government when we reconvene on 22 January."
              ],
              "wordCount": 285
            },
            {
              "id": "spk_46",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "We move to the technical group convened by Deputy Boyd Barrett. I call Deputy Healy."
              ],
              "wordCount": 15
            },
            {
              "id": "spk_47",
              "speaker": {
                "id": "SeamusHealy",
                "name": "Seamus Healy",
                "uri": "/ie/oireachtas/member/id/Seamus-Healy.D.2000-06-22"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Seamus Healy",
              "paragraphs": [
                "I wish to share time with Deputies Coppinger and Boyd Barrett."
              ],
              "wordCount": 11
            },
            {
              "id": "spk_48",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "Is that agreed? Agreed. You have a minute each."
              ],
              "wordCount": 9
            },
            {
              "id": "spk_49",
              "speaker": {
                "id": "SeamusHealy",
                "name": "Seamus Healy",
                "uri": "/ie/oireachtas/member/id/Seamus-Healy.D.2000-06-22"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Seamus Healy",
              "paragraphs": [
                "The housing and homelessness crisis is the most fundamental issue facing this country and the outgoing Government has failed to deal with it. In the Thirty-second Dáil, I introduced the Housing Emergency Measures in the Public Interest Bill and it is my intention to reintroduce that Bill at the earliest opportunity.",
                "I salute the young disability rights campaigner, Cara Darmody, from Ardfinnan, County Tipperary, who has done Trojan work in this area. However, Cara would be the first to acknowledge that a lot more needs to be done. The Government and the HSE must stop breaking the law. They must ensure that assessment of need is carried out within the six-month limit and that an appropriate place is available for every child. They must also ensure early access to therapy services and day and residential services for adults."
              ],
              "wordCount": 138
            },
            {
              "id": "spk_50",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "The Deputy’s time is up. He should conclude to be fair to his colleagues."
              ],
              "wordCount": 14
            },
            {
              "id": "spk_51",
              "speaker": {
                "id": "SeamusHealy",
                "name": "Seamus Healy",
                "uri": "/ie/oireachtas/member/id/Seamus-Healy.D.2000-06-22"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Seamus Healy",
              "paragraphs": [
                "South Tipperary urgently needs and demands the construction, as promised, of a 20-bed inpatient mental health unit at Tipperary University Hospital, the reopening of St. Brigid's Hospital in Carrick-on-Suir and the construction of the long-awaited bypasses for Tipperary town, Clonmel and Carrick-on-Suir."
              ],
              "wordCount": 42
            },
            {
              "id": "spk_52",
              "speaker": {
                "id": "RuthCoppinger",
                "name": "Ruth Coppinger",
                "uri": "/ie/oireachtas/member/id/Ruth-Coppinger.D.2014-05-23"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Ruth Coppinger",
              "paragraphs": [
                "I feel that in rallying behind its selection for Ceann Comhairle, it could be the first and last rally for women that the next government is likely to do when it comes in. I will be opposing the Fianna Fáil and Fine Gael nominee for Taoiseach, whenever they decide to put one forward. They are the parties that do not care that young people are leaving this country in droves, along with essential workers who are bitterly disappointed at the outcome of this election, the parties that do not provide school places for all and leave disabled children on waiting lists for up to seven years, and the parties that posture on Palestine as a genocide is taking place. These parties cannot be endorsed.",
                "Today, I have in front of me the nomination of Deputy Mary Lou McDonald."
              ],
              "wordCount": 138
            },
            {
              "id": "spk_53",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "Thank you. The Deputy’s time is up. I call her colleague, Deputy Boyd Barrett."
              ],
              "wordCount": 14
            },
            {
              "id": "spk_54",
              "speaker": {
                "id": "RuthCoppinger",
                "name": "Ruth Coppinger",
                "uri": "/ie/oireachtas/member/id/Ruth-Coppinger.D.2014-05-23"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Ruth Coppinger",
              "paragraphs": [
                "I want to make the point that I will be abstaining on that nomination simply because we do not have a real prospect of an alternative government."
              ],
              "wordCount": 27
            },
            {
              "id": "spk_55",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "The Deputy is running down her colleague’s time."
              ],
              "wordCount": 8
            },
            {
              "id": "spk_56",
              "speaker": {
                "id": "RuthCoppinger",
                "name": "Ruth Coppinger",
                "uri": "/ie/oireachtas/member/id/Ruth-Coppinger.D.2014-05-23"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Ruth Coppinger",
              "paragraphs": [
                "Given the recent moves to the right that Sinn Féin has made-----"
              ],
              "wordCount": 12
            },
            {
              "id": "spk_57",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "Deputy Coppinger, if there is no time left your colleague will not be able to speak."
              ],
              "wordCount": 16
            },
            {
              "id": "spk_58",
              "speaker": {
                "id": "RuthCoppinger",
                "name": "Ruth Coppinger",
                "uri": "/ie/oireachtas/member/id/Ruth-Coppinger.D.2014-05-23"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Ruth Coppinger",
              "paragraphs": [
                "Okay. They are turning their backs on vulnerable groups like trans young people and denying them healthcare, and on refugees. This makes it very difficult to give them a free pass."
              ],
              "wordCount": 31
            },
            {
              "id": "spk_59",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "Deputy Boyd Barrett, you have 20 seconds."
              ],
              "wordCount": 7
            },
            {
              "id": "spk_60",
              "speaker": {
                "id": "RuthCoppinger",
                "name": "Ruth Coppinger",
                "uri": "/ie/oireachtas/member/id/Ruth-Coppinger.D.2014-05-23"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Ruth Coppinger",
              "paragraphs": [
                "Can you stop heckling me? In doing so-----"
              ],
              "wordCount": 8
            },
            {
              "id": "spk_61",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "Thank you, Deputy, your colleague is signalling to speak. You have 16 seconds, Deputy."
              ],
              "wordCount": 14
            },
            {
              "id": "spk_62",
              "speaker": {
                "id": "RichardBoydBarrett",
                "name": "Richard Boyd Barrett",
                "uri": "/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Richard Boyd Barrett",
              "paragraphs": [
                "People Before Profit will be supporting the nomination of Deputy Mary Lou McDonald, not because we agree with Sinn Féin - we disagree with it on many things, not least its refusal to rule out coalition with Fianna Fáil and Fine Gael - but because we believe parties on the left have an obligation to end 100 years of Fianna Fáil and Fine Gael and put together the first left-wing government this State has ever seen."
              ],
              "wordCount": 76
            },
            {
              "id": "spk_63",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "Thank you. We move to the technical group convened by Deputy Michael Collins."
              ],
              "wordCount": 13
            },
            {
              "id": "spk_64",
              "speaker": {
                "id": "MichaelCollins2016",
                "name": "Michael Collins",
                "uri": "/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:00:00+00:00",
              "speakerLabel": "Deputy Michael Collins",
              "paragraphs": [
                "On behalf of our independent technical group, I congratulate the new Ceann Comhairle, Deputy Verona Murphy. We look forward to working with her over the coming years. I also thank Deputy Seán Ó Fearghaíl for the kindness he has shown all of us in the Dáil in recent years.",
                "As the leader of Independent Ireland, I am honoured to be in this Thirty-fourth Dáil, representing the people of Cork South-West. Deputy Richard O'Donoghue, Deputy Michael Fitzmaurice and I would like to welcome Independent Ireland's newest TD, Deputy Ken O'Flynn, representing Cork North-Central. We are also delighted to be working with Deputies Michael Healy-Rae, Danny Healy-Rae and Paul Gogarty in our independent technical group.",
                "Independent Ireland was set up just over 12 months ago. Today, we have 23 councillors, four TDs and one MEP. We are now the fastest growing political movement in this country. On behalf of Independent Ireland, I thank everyone who has supported us, worked with us and voted for us. In the discussions on the formation of the Government, we sincerely hope parish pump politics will not take over from policies and common sense.",
                "Independent Ireland spent many months putting our policies together to ensure a better life for everyone in this country. One of the biggest issues on the doors was the cost-of-living crisis. Once-off payments are not enough for struggling families who find it impossible to pay for childcare, heat homes and put food on the table. Regarding small businesses, we expect anyone negotiating for Government to demand an immediate drop in the VAT rate from 13.5% to 9%. On housing, more than 14,000 people are homeless, 4,000 of whom are children. Immediate action must be taken. We need to declare a housing emergency to implement emergency legislation which would streamline our planning laws for rural and urban Ireland and would also include promoting modular and log cabin houses.",
                "We in Independent Ireland have strong policies on agriculture. We are 100% opposed to the Mercosur deal. We would expect every politician going into Government to make \"No to Mercosur\" a red-line issue. A Mercosur deal would cost Irish agriculture between €45 million to €55 million. We are totally opposed to any drop in the derogation, and while we in Independent Ireland accept we need cleaner waters, it is our State, with Uisce Éireann and our wastewater treatment plants, that is causing much of the pollution in this country. Our country has to stop pointing the finger of blame at agriculture. We live in a country where we have up to 1 million people waiting for medical procedures, people with disabilities left struggling with no services and little financial means and our carers being penalised by means testing. This all has to be a major focus for the new Government. Regarding fishing, the forgotten industry in this country, this country has to appoint a stand-alone Minister for fisheries, the marine and the islands. Education also has to be a priority for the incoming Government. Schools are struggling to pay ESB bills and the heating bill. Many schools are fighting for special needs classrooms and assistants. At Independent Ireland, we would like to see a Department of efficiency and reform, which would oversee Government Department spending using private industry expertise to improve efficiency within Government Departments. We must address the waste of taxpayers' money and this Department would enable us to improve efficiency. I look forward to working with everybody in this Dáil in the coming time."
              ],
              "wordCount": 580
            },
            {
              "id": "spk_65",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:10:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "That concludes the contributions on the nomination of Taoiseach."
              ],
              "wordCount": 9
            },
            {
              "id": "spk_66",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:40:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "I must inform Members that it has been agreed with the Whips and the conveners that we will now have contributions from parties and proposed technical groups with an agreed allocation of time for each party and group. I take the opportunity to say to Members that time is time. If you are sharing time and you go over your time, you will eat into your colleagues' time. That is how we propose to carry on in the Thirty-fourth Dáil. I first call on An Taoiseach."
              ],
              "wordCount": 86
            },
            {
              "id": "spk_67",
              "speaker": {
                "id": "SimonHarris",
                "name": "Simon Harris",
                "uri": "/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:40:00+00:00",
              "speakerLabel": "The Taoiseach",
              "paragraphs": [
                "I agreed with the Clerk earlier that I rolled my contribution into one."
              ],
              "wordCount": 13
            },
            {
              "id": "spk_68",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:40:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "Thank you, so it is An Tánaiste."
              ],
              "wordCount": 7
            },
            {
              "id": "spk_69",
              "speaker": {
                "id": "MichaelMartin",
                "name": "Micheál Martin",
                "uri": "/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
              },
              "role": {
                "id": "Minister_for_Foreign_Affairs",
                "name": "Minister for Foreign Affairs",
                "uri": "/ie/oireachtas/role/minister/foreign_affairs"
              },
              "recordedTime": "2024-12-18T16:40:00+00:00",
              "speakerLabel": "Minister for Foreign Affairs (Deputy Micheál Martin)",
              "paragraphs": [
                "I wish to clarify; is it a three-minute speech?"
              ],
              "wordCount": 9
            },
            {
              "id": "spk_70",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:40:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "It is a 15-minute speech."
              ],
              "wordCount": 5
            },
            {
              "id": "spk_71",
              "speaker": {
                "id": "JohnBrady",
                "name": "John Brady",
                "uri": "/ie/oireachtas/member/id/John-Brady.D.2016-10-03"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:40:00+00:00",
              "speakerLabel": "Deputy John Brady",
              "paragraphs": [
                "No, three minutes."
              ],
              "wordCount": 3
            },
            {
              "id": "spk_72",
              "speaker": {
                "id": "MichaelMartin",
                "name": "Micheál Martin",
                "uri": "/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
              },
              "role": {
                "id": "Minister_for_Foreign_Affairs",
                "name": "Minister for Foreign Affairs",
                "uri": "/ie/oireachtas/role/minister/foreign_affairs"
              },
              "recordedTime": "2024-12-18T16:40:00+00:00",
              "speakerLabel": "Deputy Micheál Martin",
              "paragraphs": [
                "What?"
              ],
              "wordCount": 1
            },
            {
              "id": "spk_73",
              "speaker": {
                "id": "SimonHarris",
                "name": "Simon Harris",
                "uri": "/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:40:00+00:00",
              "speakerLabel": "The Taoiseach",
              "paragraphs": [
                "They just think you should do three."
              ],
              "wordCount": 7
            },
            {
              "id": "spk_74",
              "speaker": {
                "id": "EoinOBroin",
                "name": "Eoin Ó Broin",
                "uri": "/ie/oireachtas/member/id/Eoin-Ó-Broin.D.2016-10-03"
              },
              "role": null,
              "recordedTime": "2024-12-18T16:40:00+00:00",
              "speakerLabel": "Deputy Eoin Ó Broin",
              "paragraphs": [
                "Three would be too many."
              ],
              "wordCount": 5
            },
            {
              "id": "spk_75",
              "speaker": {
                "id": "MichaelMartin",
                "name": "Micheál Martin",
                "uri": "/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
              },
              "role": {
                "id": "Minister_for_Foreign_Affairs",
                "name": "Minister for Foreign Affairs",
                "uri": "/ie/oireachtas/role/minister/foreign_affairs"
              },
              "recordedTime": "2024-12-18T16:40:00+00:00",
              "speakerLabel": "Deputy Micheál Martin",
              "paragraphs": [
                "I just saw \"3\" up there on the wall.",
                "Is seans iontach é an chéad teacht le chéile de Dháil nua chun machnamh a dhéanamh ar láidreacht leanúnach an daonlathais in Éirinn. Is ócáid í chun buíochas a ghabháil arís leo siúd a raibh baol agus íobairt ag baint leis an éacht a rinne siad chun Dáil Éireann a chur ar bun agus a chruthú.",
                "Ar son Pháirtí Fhianna Fáil, is mian liom aitheantas a thabhairt inniu don obair a rinne na mílte daoine a d’eagraigh agus a reáchtáil an t-olltoghchán le déanaí. Níor chóir dúinn riamh talamh slán a dhéanamh de thoghchán atá saor, ionraic agus daonlathach.",
                "At the outset, I congratulate each and every Deputy who has been elected to Dáil Éireann. It is a very difficult task to get elected and it is a credit to each and every Member, to their families, friends and supporters to have achieved this honour. I hope they all have a very enjoyable and productive five years.",
                "As is now regularly the case, the Dáil is not in a position to nominate a Taoiseach and Government today. We are a modern European democracy with diverse representation in Parliament. It is entirely reasonable that time be taken to agree sustainable arrangements for the Government which will serve for the next five years. While we take reasonable time to move towards agreement on the composition and, more importantly, the programme of the next Government, we have a Government in place which is capable of reacting quickly if challenging events materialise. Our constitutional arrangements remain strong and, unlike in many countries, they are overwhelmingly respected. No positive purpose could be served by using today to rerun the election campaign in our speeches today.",
                "The Fianna Fáil Party is grateful for the strengthened mandate it received in the election and the fact we are the largest party both in local government and in the Oireachtas. However, our focus today is on explaining the approach we will take to using our mandate and our priorities for the next five years. Our starting point is that we believe in the power of Irish democracy to deliver for the Irish people, and we are determined that the next five years will see sustained progress on some of the most fundamental issues which have faced us for many years.",
                "The Thirty-fourth Dáil meets today as one of the democratic world's most enduring parliaments. This week 106 years ago, the Irish people voted in an election where they gave an overwhelming mandate to establish the First Dáil. In a campaign led by Éamon de Valera and masterfully managed by Harry Boland and Michael Collins, the republican vision for an independent and democratic Ireland won a spectacular victory. Within a decade of that victory, our country came through a period of great conflict with others and between ourselves. The unity of the First Dáil was never recaptured, but eventually all but a handful of the Members of that historic Assembly committed themselves to the common cause of making Dáil Éireann a force for delivering sustained progress for the Irish people.",
                "It is right and proper that this is a place where our primary focus is on the urgent needs of today and the years ahead. It would be profoundly wrong and distorting for us to see our country only in terms of problems which it faces. Our country has used its independence well and achieved dramatic progress in many areas. Irish democracy has delivered many things for the Irish people, and those who dismiss this are more interested in political grandstanding than actually making a difference. However, we must go much further.",
                "The challenge for us in this Dáil is to both protect what has been achieved and deliver sustained progress on critical issues. We must show urgency and ambition. We must use our mandates constructively and with good faith. We must also understand the gravity of the challenges faced by democracies and trading economies, and the fact that Ireland can take nothing for granted. We believe that when confronted with many different options during the election, the majority of the Irish people supported a progressive and centrist vision of action for the next five years. More radical approaches of demanding a total change in nearly every area of Government policy came nowhere near gaining enough support to claim a mandate for government.",
                "Since the election we have been engaging in good-faith discussions with others in this House who we believe to share at a minimum a commitment to various core values. We are progressing fully in line with the approach which we detailed during the election and which was subject to countless questions during interviews and debates. We believe it is impossible to build or maintain trust if every discussion and every proposal is followed by instant briefing and spinning. Therefore, we have not been providing a daily commentary on discussions and we will not be doing so as they move forward.",
                "However, I will outline today certain core priorities which are defining our approach to discussions on Government formation. The new Government must be founded on a clear programme of action as well as clear principles about how it will work. Respect and good faith in dealings with each other, agreement to focus on the full term rather than on a day-to-day or week-to-week politics and a shared commitment to action across government are fundamental points for us.",
                "So, too, is the fact that the Government be willing to work to protect the core pro-enterprise, pro-investment, pro-balanced growth economic model on which hundreds of thousands of jobs rely, and which funds our public services. The core economic projections from all forecasters, both domestic and international, are currently saying that Ireland has enduring strengths and should, if it maintains its current core economic policies, continue to see growth, rising living standards and rising Government income. This is a reasonable basis for developing a programme for the next five years but all must understand that we may also face a period of real uncertainty in the international economy. Within weeks of the first meeting of the Thirty-third Dáil, we were faced with an historic public health emergency and the fastest moving recession recorded outside of wartime. Strengthening economic resilience is not an option; it is an imperative.",
                "We also have to address structural issues that lead to many processes being unreasonably long and costly. This week we are again seeing how critical reliable supply chains are for Ireland. We have to invest in them and we have to invest in modernising both our electricity grid and making our energy supplies more secure, sustainable and lower cost. That is why a commitment to accelerating critical public infrastructure is a priority for my party.",
                "We also believe that we must all understand that free democracies are under pressure throughout the world. Ireland has to play its part in standing with other democracies and, in particular, in standing with other members of the European Union in solidarity and with a common purpose to protect and strengthen our Union. The corrosive Euroscepticism which has caused so much harm elsewhere must be rejected and the new Government must be clear from its first day that it will be Euro-positive and Euro-constructive. In particular, we need to move quickly to prepare for the Irish Presidency of the Council, which will start in 18 months' time. Given the seriousness of the issues facing the Union, we must be ready to show sustained leadership. The Presidency will represent a major political and administrative challenge for the new Government. It is, however, a challenge we can not only meet, but leave a lasting and positive impact on.",
                "Obviously, in international affairs, the new Government must be willing and able to speak up and act constructively on issues of fundamental concern. Our actions in asserting support for Palestinian statehood and for the rule of law have been reasonable and proportionate. There can never be any support given to organisations, such as Hamas, which terrorise their own people and commit terrible acts but, equally, collective punishment of the Palestinian people by Israel cannot be tolerated and there has to be limits to state actions. We believe that Ireland should seek good relations with other states but must also be willing to call out violations of basic values and international humanitarian law and laws in general and this must be part of the new Government's agreed approach.",
                "We must be willing to recognise and respond to clear and immediate threats to us. We need a more systematic approach to national security issues and we need further sustained investment in Óglaigh na hÉireann. For the first time since 2017, the numbers in our Defence Forces have grown during this year in net terms. My party believes that we have to build on this progress, expand numbers further and ensure that we have the skills, equipment and policies we need to protect ourselves against both traditional and new emerging threats.",
                "The challenge of building a lasting peace and reconciliation on this island remains a generational challenge. We saw in the past what happened when complacency was allowed to set in and years were wasted by destructive boycotts and dwindling investment. Because of the shared island initiative, for the first time in our history there is major funding and Government support building lasting connections, for trying to overcome the economic and social damage of conflict and for sustained examination of what we share and what more we could share on this island. In every possible way, action is speaking louder than words. We now need to further accelerate the work of this initiative and to deepen the scale and ambition of its work.",
                "Housing must be a defining issue for the next Government. We have just come through a period of dramatic change in policy and also sustained action to put in place the foundations for a permanent expansion in the number of homes for purchase or rent completed each year. If ever there was an area where impact can only be measured fairly over a longer period, it is in housing. The housing starts this year are higher than expected and we need to maintain and accelerate this momentum. We need sustained investment in key housing infrastructure. We need to ramp up the work of the Land Development Agency. We need to directly support people who want to own their own home or to afford a place to rent. Clear and sustained action on housing must be central to the new Government's plan.",
                "Protecting the health of the Irish people is, for us also, an essential part of any programme we agree. The development of specialist care services, under Stephen Donnelly, represents a lasting achievement which will always be to his credit. Reducing the cost of accessing care, expanding core capacity and creating new services are a core part of the action we want to see during the next Government and we also want to see a permanent culture change and step-change in disability services.",
                "By various estimates, last year the total spending on disability was over €12 billion. Particularly when it comes to specialist supports being available when and where they are needed, business as usual will not ensure that children and adults receive the support they need. As Fianna Fáil made clear during the campaign, a commitment to a radical change and expansion in the availability of therapies for children with special needs is a core demand of ours. At all levels and in all parts of Government, we want disability to not just receive additional funding but also to benefit from an openness to new approaches and a new urgency.",
                "Education was one of our priority issues during the campaign and it will continue to be. The latest international reviews say that key policies in education are having a sustained and positive impact. Reading and literacy scores are rising. School completion rates are rising and very high in international terms. Higher education participation is now amongst the highest in the world, with real progress in inclusion being part of this. We have to build on this. We want to move forward with the largest programme of building and refurbishment in the history of our schools. We want to increase the teaching and financial resources available to all schools. We want to permanently improve the funding of higher education and accelerate the provision of affordable accommodation for students.",
                "Action on climate and biodiversity must be a priority for any Government we will participate in. While there is and must be room to argue about specific policies and to propose new approaches, there is no room to challenge either the core imperative for action or the overriding importance of meeting our targets. Particularly given the scale of Ireland's population growth in the past 30 years, it is an enormous challenge but the recent 7% drop in carbon emissions is a sign of real progress. The new Government must work harder to deliver progress on reducing carbon emissions and protecting our biodiversity and it must do so while delivering direct aid and benefits to people.",
                "The new Government will continue to face both a challenging international situation and a range of both urgent and complex issues. It cannot be complacent and it must be built on foundations which can last the full term. Lasting a full term is not about how long you can hold power; it is about the fact that we do not need a short-term approach to long-term challenges. We need an understanding that delivering real progress does not come through loud speeches; it comes through the much harder work of developing, negotiating, implementing and revising action. It requires clear agreements on policies and an unshakeable commitment to constructively working together, not only on behalf of ourselves and our parties but, more important, on behalf of the Irish people as a whole.",
                "The late Governor of New York, Mario Cuomo, in what has become one of the most widely quoted political statements of our time, once said, \"You campaign in poetry; you govern in prose\". I am not sure that there was that much poetry during the recent campaign but he was surely right in the core point that when in government, the substance of delivering for the people requires a focus and directness all too often missing in campaigns.",
                "Sa Dáil nua seo, beidh ról lárnach ag an obair a dhéanfar chun todhchaí na tíre seo a threorú. Is léir go bhfuil orainn dul i ngleic le cúrsaí sóisialta, geilleagrach, cultúrtha agus timpeallachta agus le cúrsaí a bhaineann le daonlathas. Agus sinn i mbun idirbheartaíochta chun rialtas nua a chur ar bun don téarma Dála seo leis an mandáid atá againn in úsáid mar Bhaill den Teach seo, beidh Fianna Fáil ag caint le dea-thoil agus meas.",
                "Beidh plé agus cainteanna bunaithe ar an bhforógra toghcháin a bhí againn agus sinn dílis i gcónaí do na luachanna daonlathacha poblachtacha ar a raibh Dáil Éireann bunaithe beagnach 106 bliain ó shin.",
                "Guím Nollaig faoi shuaimhneas agus faoi thaitneamh ar gach aon duine sa Teach seo, ar fhoireann an Tí go háirithe, a d'oibrigh go dian dícheallach ar ár son i rith na bliana seo caite. Nollaig shona agus faoi mhaise daoibh go léir."
              ],
              "wordCount": 2561
            },
            {
              "id": "spk_76",
              "speaker": {
                "id": "MaryLouMcDonald",
                "name": "Mary Lou McDonald",
                "uri": "/ie/oireachtas/member/id/Mary-Lou-McDonald.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Mary Lou McDonald",
              "paragraphs": [
                "Ar dtús gabhaim míle buíochas leis na céadta míle duine a chaith vóta san olltoghchán ar son Shinn Féin, ar son athraithe agus ar son Rialtais nua. Déanaim comhghairdeas ó chroí le gach duine sa Teach inniu a toghadh mar Theachta Dála sa Cheathrú Dáil is Tríocha. Is onóir mhór é a bheith tofa ag toghdóirí mo Dháilcheantair agus tá sé i gceist agam mo lándícheall a dhéanamh ar son Bhaile Átha Cliath Láir agus ar son mhuintir na hÉireann. Congratulations also to you, madam Ceann Comhairle. Lá stairiúil atá ann duit féin agus dúinn go léir agus tú tofa mar an chéad bhean riamh le bheith mar Cheann Comhairle na Dála, a first for women again and a welcome one at that, although it was part of the manoeuvrings for the entry back into government of our friends across the way. I cannot welcome that but I wish you very well.",
                "And so the election is over and the dust is settling; the job of representation begins. There are 577 people on hospital trolleys today and almost one million people on treatment waiting lists. The stress and trauma of people not able to afford a home of their own persists. Parents of children with special needs and disabilities do daily battle with the system to access services and supports that they so badly need. As we face into Christmas, a time when spirits are high but so too are the costs, families continue to struggle with the cost-of-living crisis that is a source of increasing hardship. Too many children face a Christmas of homelessness and worry whether Santa will be able to find them. The election is over but the real damage, consequences and lost opportunities of Fianna Fáil and Fine Gael Governments remain - real and lived.",
                "In the election, we championed a new Government, a Government centred on policies and plans that can deliver real improvements in things that matter to ordinary people. The contours of that vision for a better future are shaped by a belief that everyone should have a home of their own, by the determination to make housing affordable, to bring home ownership back into the reach of working people and to restore the hope of a generation. It was shaped by the need to transform our health service, to ensure people get the healthcare and treatment they need, and shaped by the resolve to deliver affordable childcare for families, to meet the cost-of-living crisis head on, to ensure that those on average incomes never again pay USC, to ensure that our young people can build a life at home in Ireland instead of being forced out to seek opportunity abroad. It was shaped by the need to revolutionise services and supports for our citizens living with disabilities, for independent living and rights, and to give a clear unequivocal commitment to scrap the unfair means test for carer's allowance.",
                "The election is over but our determination to deliver remains and it is for that reason my party, Sinn Féin, nominated me as Taoiseach today. There is no question of wasting time. There is, in fact, no time to waste. Hundreds of thousands of people voted for real progress and a better future. They voted for Sinn Féin, but not just for us - for other parties, too, who join us in a belief that politics must change and that we need a new Government. Those votes count. Those votes matter. They are the votes of working class communities, of working people, of families and of so, so many young people. They voted for a Government that is on their side and has their backs and they are now disappointed. Some are angry that the same old two will hold on to power again. The Fianna Fáil-Fine Gael partnership is in the driving seat when it comes to Government formation. There is no doubt about that. I have consistently said that the worst possible outcome of the election would be Fianna Fáil and Fine Gael back in government together and I repeat that assertion today. In 2020, Micheál Martin said that Fine Gael back in government is not change."
              ],
              "wordCount": 695
            },
            {
              "id": "spk_77",
              "speaker": {
                "id": "MichaelMartin",
                "name": "Micheál Martin",
                "uri": "/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
              },
              "role": {
                "id": "Minister_for_Foreign_Affairs",
                "name": "Minister for Foreign Affairs",
                "uri": "/ie/oireachtas/role/minister/foreign_affairs"
              },
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Micheál Martin",
              "paragraphs": [
                "What did you say in 2020?"
              ],
              "wordCount": 6
            },
            {
              "id": "spk_78",
              "speaker": {
                "id": "MaryLouMcDonald",
                "name": "Mary Lou McDonald",
                "uri": "/ie/oireachtas/member/id/Mary-Lou-McDonald.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Mary Lou McDonald",
              "paragraphs": [
                "It is rare, but the Tánaiste was actually right. Consistency did not matter, Micheál, although you have been consistent in this: of recent years you have been hell bent on putting Fine Gael back into Government. This time, you hope for another five years, to copper-fasten and lead to 19 years of Fine Gael in power. The Tánaiste is so committed to that particular goal that he will not even countenance talking to Sinn Féin, the second-largest party in this Dáil and, it must be remembered, the largest political party on the island of Ireland. In so doing, he refused to recognise the vote of every person who voted for Sinn Féin as equal to those who voted for Fianna Fáil, Fine Gael-----"
              ],
              "wordCount": 123
            },
            {
              "id": "spk_79",
              "speaker": {
                "id": "PaulMcAuliffe",
                "name": "Paul McAuliffe",
                "uri": "/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Paul McAuliffe",
              "paragraphs": [
                "Not true."
              ],
              "wordCount": 2
            },
            {
              "id": "spk_80",
              "speaker": {
                "id": "MaryLouMcDonald",
                "name": "Mary Lou McDonald",
                "uri": "/ie/oireachtas/member/id/Mary-Lou-McDonald.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Mary Lou McDonald",
              "paragraphs": [
                "-----or indeed for anyone else, that their voices are equal, that their views are equal, that their hopes for the future are equal and that there are no second-class mandates and certainly no second-class voters."
              ],
              "wordCount": 35
            },
            {
              "id": "spk_81",
              "speaker": {
                "id": "PaulMcAuliffe",
                "name": "Paul McAuliffe",
                "uri": "/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Paul McAuliffe",
              "paragraphs": [
                "Shocking."
              ],
              "wordCount": 1
            },
            {
              "id": "spk_82",
              "speaker": {
                "id": "MaryLouMcDonald",
                "name": "Mary Lou McDonald",
                "uri": "/ie/oireachtas/member/id/Mary-Lou-McDonald.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Mary Lou McDonald",
              "paragraphs": [
                "There is no reason to believe that, having caused a housing crisis and made it worse, having sustained a crisis in health, having failed to deliver for working people, Fianna Fáil and Fine Gael, its junior partner, are in any position to straighten matters out. The parties that created these problems are not going to solve them. It is as simple as that.",
                "I was alarmed this morning to hear, as I went innocently about my business in my kitchen, Members from Government benches on the airwaves congratulating themselves on their performance in housing and health over the past five years. Let us be very clear. No amount of back slapping or plámás can hide your failures because people live with them. Yours is a partnership designed to cling to power at all costs and to preserve the status quo for as long as you possibly can. The past five years demonstrated in the sharpest way that the parties that have led Government now for 100 years have run out of steam and have run out of ideas. They remain wedded to broken policies. They dress up their failures as success and then they offer the same worn-out excuses when challenged. All the while, the crises in housing and health and the cost of living have deepened. Spin, soundbites, broken promises and excuses are not the currency of good government. Government is rightly judged on action, delivery and results."
              ],
              "wordCount": 239
            },
            {
              "id": "spk_83",
              "speaker": {
                "id": "PaulMcAuliffe",
                "name": "Paul McAuliffe",
                "uri": "/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Paul McAuliffe",
              "paragraphs": [
                "And votes."
              ],
              "wordCount": 2
            },
            {
              "id": "spk_84",
              "speaker": {
                "id": "TimDooley",
                "name": "Timmy Dooley",
                "uri": "/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Timmy Dooley",
              "paragraphs": [
                "That is why we won."
              ],
              "wordCount": 5
            },
            {
              "id": "spk_85",
              "speaker": {
                "id": "MaryLouMcDonald",
                "name": "Mary Lou McDonald",
                "uri": "/ie/oireachtas/member/id/Mary-Lou-McDonald.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Mary Lou McDonald",
              "paragraphs": [
                "Be aware. Be very aware that you will be judged-----"
              ],
              "wordCount": 10
            },
            {
              "id": "spk_86",
              "speaker": {
                "id": "PaulMcAuliffe",
                "name": "Paul McAuliffe",
                "uri": "/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Paul McAuliffe",
              "paragraphs": [
                "We were judged."
              ],
              "wordCount": 3
            },
            {
              "id": "spk_87",
              "speaker": {
                "id": "MaryLouMcDonald",
                "name": "Mary Lou McDonald",
                "uri": "/ie/oireachtas/member/id/Mary-Lou-McDonald.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:00:00+00:00",
              "speakerLabel": "Deputy Mary Lou McDonald",
              "paragraphs": [
                "-----on the big promises you made to get back into power at all costs. History tells us that campaigns are where Fianna Fáil and Fine Gael make their promises and in government is where they break them. It is a tale as old as time itself.",
                "We already have sight of what is in store should Micheál Martin and Simon Harris get this deal of theirs over the line with the manful help of Deputy Michael Lowry. What we will have is more of the same. They simply propose to pick up where they left off before the election.",
                "The discussions between the two parties, not surprisingly, have centred on the carve-up of power and position. The parties have argued publicly over the role of the rotating Taoiseach, over who gets which ministerial job and over who gets the big meeting rooms in Leinster House. There has been no talk, mind you, of double-digit rent increases or of the nearly 15,000 people who have been made homeless on the watch of those parties. More than 4,000 children are now in emergency accommodation. There has also been no talk of the Capuchin centre in Dublin that ran out of food parcels and vouchers for those in need so fast that its volunteers were left stunned. Those are the fruits of unchecked deprivation and an embedded cost-of-living crisis that leaves working households in real distress. More than that, it reflects the out-of-touch culture of entitlement that defines the centuries-old cosy club of Fianna Fáil and Fine Gael.",
                "There is hope. The political landscape of this State has been transformed irrevocably. All is changed, and changed utterly. The days of the same two parties controlling not just government but also opposition for generations are gone and not coming back. This election confirmed that 2020 was not a flash in the pan and was not simply a once-off election. Whether anyone likes it or not, our party, Sinn Féin, is now a significant and potent force in political life here. We are determined to work with others elected to this Dáil to build and strengthen the alternative to perpetual Fianna Fáil and Fine Gael government. Collectively, we were elected on a mandate of change and we have considerable strength. Our responsibility now is to collaborate and co-operate and to work together in common purpose to advance a platform of progress and force a change of direction from the policies that have wrought crisis, hardship and a denial of opportunity for far too many. We must also do better at convincing and inspiring more people, rallying more people to the vision of a better, fairer and more equal Ireland, and we will do that.",
                "I know there is disappointment among a significant portion of the population. It is likely that we will not have the new government and new approach that is so desperately needed. That is politics. That is elections."
              ],
              "wordCount": 486
            },
            {
              "id": "spk_88",
              "speaker": {
                "id": "MichaelMartin",
                "name": "Micheál Martin",
                "uri": "/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
              },
              "role": {
                "id": "Minister_for_Foreign_Affairs",
                "name": "Minister for Foreign Affairs",
                "uri": "/ie/oireachtas/role/minister/foreign_affairs"
              },
              "recordedTime": "2024-12-18T17:10:00+00:00",
              "speakerLabel": "Deputy Micheál Martin",
              "paragraphs": [
                "That is democracy."
              ],
              "wordCount": 3
            },
            {
              "id": "spk_89",
              "speaker": {
                "id": "MaryLouMcDonald",
                "name": "Mary Lou McDonald",
                "uri": "/ie/oireachtas/member/id/Mary-Lou-McDonald.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:10:00+00:00",
              "speakerLabel": "Deputy Mary Lou McDonald",
              "paragraphs": [
                "That is democracy. I respect everyone who voted in this election. I respect the choices they made on their ballot papers. My message to those who feel downhearted today is simply that it is okay to feel disappointed but they cannot and must not feel defeated. The working people of Ireland are no strangers to adversity. They know better than most that night is darkest just before the dawn. It may a take a little longer for the sun to rise but it will eventually rise on a new day in Ireland. We have not lost hope, not one bit; far from it. Our belief and determination are even stronger because we know that progress is never achieved on a road that is straight and smooth. It is never achieved without facing challenge and adversity along the way. Progress is achieved when you stick to the task, give it your all and carry on when you are tested. So, my friends, we carry on. We carry on certain in the belief that it will not be Fianna Fáil agus Fine Gael forever.",
                "The faces and words of those I met on the campaign trail are not simply memories to think on years from now. For me, they are the inspiration that moves me forward today. I am inspired by TJ, an incredible young man with scoliosis who was left on a waiting list so long that his condition became inoperable. He still finds the courage to speak up for others. I am motivated by the young teacher brought to tears as she told me of her frustration at not being able to build the life she wants here in Ireland and seeing so many of her friends forced to leave. I am motivated by the determined anger of student nurses and midwives, and apprentices who know they are being short-changed and want better. I am driven by the humanity and love of the carers who I met everywhere, including the woman in Ballymun who works 24-7, day and night, looking after her son and who has been so badly let down by the State. I am both heartbroken and driven by the courage of Luke, a 22-year-old Dublin man. He has lived through years of homelessness but has worked his way and built his life through it. What an incredible young man. Above all, I am inspired by the kindness, generosity and unwavering optimism of the working people of Ireland.",
                "We meet one week from Christmas, a time when we reflect on the past and look to possibilities for the future. I want everyone who wants to see a new Government for working people to know that we are not giving up and we never will because there is too much at stake and too much to be achieved. We will keep going. We will make this journey. We will continue to fight and stand up for working people, and we will have their backs. We will defend and advance the rights of working people, families and communities to a life full of opportunity and hope, achievement and happiness, and prosperity too. That is a future worth believing in. It is worth working for and it is a future that we can achieve.",
                "Leanfaidh muid ag obair chun tacaíocht a mhealladh ar son rogha eile seachas rialtas faoi cheannas Fhianna Fáil agus Fhine Gael chun go mbainfidh muid lá amach faoi dheireadh le rialtas ar son na cosmhuintire oibre, ar son teaghlaigh agus ar son an phobail.",
                "I believe in the path to a new united Ireland. Our country remains partitioned. The road to a better future was never going to be walked easily. I also know that it can be walked, traversed and completed together. Change can run as fast as white waters or slowly, to the pace of a babbling brook, but the waters of history keep flowing, and they flow now. They flow in the direction of a new government for ordinary people and a new era when workers, families and communities truly come first. The change we talked about in the last election can be slowed and frustrated for a time but be very clear that in the end, it will not be stopped. As we meet today at the first gathering of the Thirty-fourth Dáil, we have never been more determined or confident that we, collectively, will get there."
              ],
              "wordCount": 734
            },
            {
              "id": "spk_90",
              "speaker": {
                "id": "IvanaBacik",
                "name": "Ivana Bacik",
                "uri": "/ie/oireachtas/member/id/Ivana-Bacik.S.2007-07-23"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:10:00+00:00",
              "speakerLabel": "Deputy Ivana Bacik",
              "paragraphs": [
                "Congratulations to all of those newly elected and returned TDs, as we take our seats today for the first time in the Thirty-fourth Dáil. I am immensely proud of my Labour Party colleagues sitting around me in our newly enlarged parliamentary party. Deputies Alan Kelly, Ged Nash, Duncan Smith and I are delighted and thrilled to be joined by seven new Labour Party Deputies, namely, Deputies Eoghan Kenny, Conor Sheehan, Ciarán Ahern, Marie Sherlock, George Lawlor, Rob O'Donoghue and Mark Wall. We are immensely proud of our colleagues, who are hard-working, principled, left-wing representatives, rooted in their communities and driven by their values. To all who voted for the Labour Party on 29 November, I thank you, and a personal thanks to those who voted for me in Dublin Bay South. It is an honour to be re-elected to serve my community. It is the honour of a lifetime for all of us in this House to be elected or re-elected to serve.",
                "I pay tribute to all our Labour Party activists and campaigners who gave their time and commitment during the recent campaign and to our colleagues who missed out on election this time and who are not joining us here today.",
                "For those of us who are here today, this is a proud day, but it is not about us, nor should it be. For as long as the Thirty-fourth Dáil sits, my focus and that of my colleagues around me is on the communities that we represent and are honoured to serve. We must remain focused on our communities, which have been failed by many of the policies and priorities of the outgoing Government. They have been failed on housing and healthcare.",
                "All of us, over the course of the campaign, will have heard intimate and, in many cases, heartbreaking personal stories from those who we have met while canvassing. I think of the elderly man who told me, in tears, about facing the emigration of his second adult child over Christmas. They are adult children who could not see a future for themselves in this country. I think of the older woman who told me of her great distress at having spent weeks with her husband, whose condition deteriorated in a hospital that was desperately understaffed. I think of the many parents I met who could not access disability services for their children or special needs places in schools, who simply could not access a childcare place for a newborn baby or toddler, or who are facing enormous difficulty in getting back to work. These are people who have been let down by the State. They deserve to be treated with respect. They deserve honest politics. They need and want a message of hope. Hope can be in short supply sometimes.",
                "Serious challenges face our country and planet. The housing crisis in Ireland continues to ravage our communities. It leaves so many families vulnerable to eviction. It starves our public services of staff. It causes chronic understaffing in our schools and hospitals. It is perpetuating the national scandal of 4,500 children without a home. We see a lack of childcare and school places, overcrowded hospitals with lengthening waiting lists and trolleys in corridors, and of course the existential threat posed by climate change. This week, headlines have been dominated by the closure of Holyhead Port, the consequence of an extreme weather event reminding us of the fragility of our way of life. Many lose hope when they see the war and conflict around the world, with the displacement of millions in Sudan, the savage bombardment of Ukraine by Putin and the genocide that continues to unfold in Gaza. That, Tánaiste, is why we need to see the occupied territories Bill enacted. Regardless of whoever is in the next government, it needs to be enacted as a matter of urgency. I was proud to stand with others seeking that enactment outside Leinster House this morning.",
                "Over the term of this Dáil, the focus of the Labour Party is on seeking to achieve an active State that will transform lives, will be able to relieve poverty and can give hope. In the general election, we campaigned for a constructive programme to build a sustainable Ireland that protects and restores our environment through urgent and ambitious State action. We campaigned for a fairer Ireland where every child has the best start in life through the provision of a publicly provided childcare and early years scheme, and an equal Ireland which rejects division and values diversity.",
                "In the coming term, a choice awaits Members of this House. We can work collaboratively, from opposition or government, towards a vision of Ireland based on that concept of an active State which takes responsibility to deliver housing, childcare and climate action and public transport. Alternatively, we can see an Ireland that is bereft of any coherent vision, seeks simply to keep doing more of the same, and does not seek to change policies. We would see short-termism ruling the roost, where a better Ireland will not be built for everyone. For our part in the Labour Party, as a centre-left party, at every opportunity we will tenaciously put forward the case for an activist State that will build affordable homes, will reach climate targets and will construct a modern connected transport system.",
                "We must be honest with people that to achieve that vision of an active State, we need a solid tax base to achieve that level of public investment. In the election that has just passed, the Labour Party never entered the tax bidding war. We did not seek to bribe people with their own money because we believe in investing in public services. We believe the State must deliver the services that people need. Children need care, people need public transport and people need the roll-out of a massive retrofitting programme. We need to see the State enabling ambition at all stages of life. We need it to invest in offshore wind development and in the sort of ambitious climate programmes that will be needed to meet our targets. We called for a fair tax system, not for narrowing the tax base. We wanted to see an enhanced obligation on those who are asset-wealthy to contribute so that we have the resources to build, teach and grow, because we cannot return to the reckless McCreevy economics of the Celtic tiger years.",
                "Despite the challenges, we in the Labour Party are excited about the prospect of building a better Ireland. We focused in the election campaign on what we can do constructively to build a better Ireland for all and on the priorities that are so clear. We focused on housing as a priority, for example by developing the Land Development Agency into a properly resourced State construction company that can deliver homes directly and contribute to the goal that we all share of building at least 50,000 new homes a year, a goal that is absolutely necessary to meet the urgent need for homes in our communities. On climate, we called for urgent State action to accelerate decarbonisation and deliver a just transition. On our health services, we called for the roll-out of free GP care to every child in the State, so no parent has to delay a doctor's appointment due to cost. On children's rights, we put forward a clear and costed vision for a public childcare scheme. We are the party of work and of the trade union movement. On workers' rights, we put forward a clear programme for change to tackle the scourge of low pay across our communities, and to protect workers' rights to organise, to bargain collectively and to join a trade union. We put forward a plan to address the cost-of-living crisis, to use the machinery of the State to drive down energy and insurance prices and remove what are effectively taxes on the poor, which are surcharges on those who pay by instalment.",
                "We believe that our vision of an active State can transform lives. We know that markets fail and that the State needs to intervene to protect those who are most vulnerable in our society. We have always been a party that is serious about delivering change. Whatever the outcome of current talks on government formation, we have a serious intent to work with others over the course of this Dáil term to progress our plans to deliver on that vision of an active State. During the election campaign, I called for the formation of a common platform of the left to see the implementation of centre-left and environmental policies and to deliver for communities. As the political arm of the trade union movement, we understand the value of unity and the strength of numbers. We intend to continue to work on that common left platform over the term ahead because we know that when our movements unite on issues, as we did on marriage equality, the repeal of the eighth amendment and Sláintecare, the establishment will move with us. We intend to keep working on that common left platform and to continue to work to the goal of a centre-left-led government.",
                "On behalf of the Labour Party, I wish all TDs of the Thirty-fourth Dáil well. Our work starts now to build better together. I end by thanking all the staff in Leinster House and wishing everyone a peaceful Christmas and happy new year."
              ],
              "wordCount": 1574
            },
            {
              "id": "spk_91",
              "speaker": {
                "id": "PadraigRice",
                "name": "Pádraig Rice",
                "uri": "/ie/oireachtas/member/id/Pádraig-Rice.D.2024-11-29"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:20:00+00:00",
              "speakerLabel": "Deputy Pádraig Rice",
              "paragraphs": [
                "I congratulate the Ceann Comhairle on her election. As I rise to make my maiden speech in the Dáil, I begin by expressing my heartfelt thanks to the thousands of people in Cork South-Central who voted for me. I am incredibly grateful for their support and I will work hard every day to uphold the trust they have placed in me. On this special occasion, I also thank my family, friends and campaign volunteers who helped me through not one but two elections this year. In particular, I thank my husband, Aaron, who successfully managed both campaigns. I am incredibly grateful for his love, commitment and never-ending support.",
                "From the outset, I state my firm belief that we can make Ireland a Republic of equals, where everyone has access to affordable housing, quality healthcare, a good education, a decent job and a sustainable future. The Social Democrats believe that there must be a social floor below which no one is allowed to fall. To achieve this, we must move in a new direction and take a different approach. The housing plans and policies that have been pursued over the last number of decades have utterly failed. They have left us with record levels of homelessness, soaring rents and unaffordable house prices. People of all ages and from all corners of the country are demanding change. The solution is for the State to play a greater role in the direct delivery of genuinely affordable homes. We have to see a serious scale-up of public housing, an end to no-fault evictions and an increase in the taxes on vacant and derelict properties.",
                "Too many people in Ireland continue to live in fear about accessing healthcare.",
                "They fear rising health insurance costs, long waiting lists, overcrowded hospitals and the horror of being treated on a hospital trolley. The Social Democrats are proud to have led the way on Sláintecare but progress towards universal healthcare has been far too slow.",
                "I want to put on the record my commitment to delivering solutions for the people of Cork and of Ireland. Together we can build a republic of equals."
              ],
              "wordCount": 354
            },
            {
              "id": "spk_92",
              "speaker": {
                "id": "JenCummins",
                "name": "Jen Cummins",
                "uri": "/ie/oireachtas/member/id/Jen-Cummins.D.2024-11-29"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:30:00+00:00",
              "speakerLabel": "Deputy Jen Cummins",
              "paragraphs": [
                "Go raibh maith ag an Ceann Comhairle agus comhghairdeas léi. What a year of elections it has been for many people in this Chamber. I am delighted to be here with people from all over the country who are committing to making Ireland a better place to be for everyone. Let us work hard to ensure we remember all of those people who are relying on us and who have put their trust in us. Let us use our mandate across all of our political views to improve housing, education and the health system, to name but a few.",
                "As I stand here, I am thinking about all of the children and young people I have worked with over the past 30 years through youth arts, youth services, the school completion programme, my doctoral work and through my teaching in DCU. I am here in front of many Members' children and young people, and indeed my own children, who are up in the Gallery. In my work to date and now in my new role in the Thirty-fourth Dáil, I will focus on ensuring our country will be the best place it can be for now and for their future.",
                "My husband and dad are also here celebrating my first day. Many of us here today have members of their family who are not here due to illness or, sadly, through bereavement. My mum died in May, a month before the local elections, and I know there are others in this Chamber today who have also lost people through death. We must remember them today. I would like all elected Members to the Thirty-fourth Dáil to remember how we feel today, to respect one another, to find humanity in one another and strive to ensure we find our commonalities and not always our differences. I look forward to representing the people of Dublin South-Central to whom I am very grateful for voting for me. I look forward to representing them along with all of the people in this Chamber."
              ],
              "wordCount": 339
            },
            {
              "id": "spk_93",
              "speaker": {
                "id": "LiamQuaide",
                "name": "Liam Quaide",
                "uri": "/ie/oireachtas/member/id/Liam-Quaide.D.2024-11-29"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:30:00+00:00",
              "speakerLabel": "Deputy Liam Quaide",
              "paragraphs": [
                "I am really honoured to be making this address today as a Social Democrat TD for Cork East in the Thirty-fourth Dáil. I thank the people who placed their trust in me in the election. I also owe a huge debt of gratitude to the party members, relatives and friends who put heroic efforts into my campaign.",
                "Ireland is a great place to live with a flourishing economy, yet so many of the basics of a modern, prosperous country are not in place. The lack of affordable housing, the neglect of our disability and mental health services and the decline of our natural world are all the results of political decisions over many years and can be resolved with a different type of political will. If we continue with business as usual, inequality will become more entrenched and social divisions will deepen. These conditions are fertile grounds in which the far right will thrive.",
                "In terms of our international relations, we have a particular responsibility in respect of Palestine because our closest allies, the US, the EU and the UK, are aiding and abetting crimes by the Israeli Government in these territories that debase our collective humanity and make a mockery of the idea of a western, rules-based order. These crimes include mass murder, ethnic cleansing and enforced starvation of innocent civilians, among other unthinkable deprivations and cruelties. We frequently hear legitimate concerns about Russian interference in western democracies but we also need to confront interference by US and Israeli diplomats in the enactment of the occupied territories Bill which was passed by a majority of TDs, two governments ago, in 2019. The Bill has been in limbo since, not because of legal constraints but because of diplomatic pressure.",
                "I look forward to working over the coming Dáil term towards a fairer society, better resourced public services, more ambitious climate and biodiversity targets, and the consistent application of international law."
              ],
              "wordCount": 320
            },
            {
              "id": "spk_94",
              "speaker": {
                "id": "AidanFarrelly",
                "name": "Aidan Farrelly",
                "uri": "/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:30:00+00:00",
              "speakerLabel": "Deputy Aidan Farrelly",
              "paragraphs": [
                "In my first contribution in the House, I extend my congratulations to the Ceann Comhairle and my heartfelt thanks to the people of Kildare North for placing their trust in me. I would like to take a moment to appreciate my friend, the former TD, Catherine Murphy. I thank fellow Members here who have passed on their warmest regards to Catherine for the work she has done. I also thank my colleagues in the Social Democrats in Kildare North for the work they did throughout this campaign but, most of all, I extend my warmest thanks to my best friend, Aisling, to my children, Cillian, Ella and Tadhg, and to my family who are here today, for their enduring support in recent months.",
                "Despite having electoral success, none of us has actually achieved anything yet. The work starts today and this is an opportunity for us to start to work together. We all have local priorities and, for me, a resolution of the situation in Castletown House is one such priority. I ask the current Government to find that resolution in the coming weeks and months, if possible.",
                "I have been a professional youth worker and community worker for 15 years and believe that investing in children and young people is not only about investing in our future but, critically, it displays to the world our values of education, equality, anti-racism, social justice, sustainability and empowerment. Let us be ambitious about developing a public model of childcare that delivers quality services, pays staff accordingly and does not cripple young families with a second mortgage payment. We cannot ignore the reality that, in some counties, our school systems are creaking. Class sizes are spiralling out of control. We may have free books, free transport and free school meals, but under the bonnet of those headlines, there are significant issues with capacity, quality and delivery. Children, teachers, SNAs and the wider school community deserve better. Youth work services, child and adolescent mental health services and recreational opportunities for children and young people are the key to improving the mental and physical health of young people in our communities. We need workforce planning now and we needed long-term investment in these services yesterday. Policy should not create divides; it should unite. Over the course of the next five years we in this Chamber have an opportunity to address the structural inequalities in our society and I look forward to working with everybody in this House in achieving same."
              ],
              "wordCount": 415
            },
            {
              "id": "spk_95",
              "speaker": {
                "id": "CatherineConnolly",
                "name": "Catherine Connolly",
                "uri": "/ie/oireachtas/member/id/Catherine-Connolly.D.2016-10-03"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:30:00+00:00",
              "speakerLabel": "Deputy Catherine Connolly",
              "paragraphs": [
                "Ar dtús báire, is mian liom mo chomhghairdeas a chur in iúl don Cheann Comhairle. Gan dabht, tá éacht déanta aici. Ní raibh bean riamh sa Chathaoir, ról nó cóta sin. Tá éacht déanta aici agus níl amhras ar bith orm ach go mbeidh sí cóir agus cothrom agus í ag déileáil linne sa Dáil.",
                "On a more general level, the people of this beautiful country are crying out for change. They are crying out for leadership that will guide us through the transformative action that is necessary to deal with climate change and the normalisation of wars, both of which are intrinsically linked. That change simply cannot happen with the same parties who fail to recognise that we cannot proceed with business as is. It is no longer an option. I have given my word that I will be part of that change but I will do it in a manner that enshrines inclusiveness, equality and sustainability. The first step in that is housing as a right. A radical reset in housing policy is urgently required, as set out by the Housing Commission. We cannot proceed with a policy that results in the obscenity of 15,000 people being homeless. People in this country are desperately seeking to place their trust in a political system that delivers public services in return for taxation, but the existing political parties, with the help of the Independents, cannot achieve that."
              ],
              "wordCount": 237
            },
            {
              "id": "spk_96",
              "speaker": {
                "id": "PaulMurphy",
                "name": "Paul Murphy",
                "uri": "/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:30:00+00:00",
              "speakerLabel": "Deputy Paul Murphy",
              "paragraphs": [
                "Today the corporate landlords, the big developers, and the tax-avoiding corporations can breathe a sigh of relief. They are going to have a government that will serve their interests but most people are being left behind, including the thousands queuing for food parcels, those spending Christmas in emergency accommodation, the families waiting for necessary therapies for their children, the nurses and medical scientists who felt compelled to vote for industrial action, and the ordinary workers who are struggling to get by. They are the people I am here to represent. People Before Profit will fight against this government of the rich every single step of the way. What we need is a left government that represents the interests of the many instead of the wealthy few and that implements eco-socialist policies to avert catastrophic climate change while improving people's lives. We will not get that today.",
                "What should the left do now? Rule out coalition with Fianna Fáil and Fine Gael and put forward left-wing policies. There should be no scapegoating of asylum seekers or trans people. The blame for the housing and health crises should be put on those at the top and not those at the bottom. The left should work together to build mass movements outside the Dáil that can make a real difference on disability justice and housing, and immediately implement the occupied territories Bill as a step to comprehensive sanctions on Israel."
              ],
              "wordCount": 237
            },
            {
              "id": "spk_97",
              "speaker": {
                "id": "BrianStanley",
                "name": "Brian Stanley",
                "uri": "/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:40:00+00:00",
              "speakerLabel": "Deputy Brian Stanley",
              "paragraphs": [
                "Déanaim comhghairdeas mór leis an gCeann Comhairle. I thank the people of County Laois for electing me to the Thirty-fourth Dáil. It was a great honour to be elected. It truly showed that the seat does not belong to any family or party. It belongs to the people of Laois. In fact, all three seats in Laois belong to the people there.",
                "There are huge challenges ahead in the constituency I represent. We need affordable housing for those caught in the middle who cannot get a mortgage or get on a social housing waiting list. We need schools. School capacity is under serious pressure. We need to get Coláiste Dhún Másc built. We need the relief road at Mountmellick, which Taoiseach Simon Harris and Deputy Aird promised during the election campaign. I look forward to its delivery. I will hold the Government to account on that. We need flood relief schemes at Mountmellick and Portarlington. We need primary care centres for Portlaoise and Mountrath, as well as for Rathdowney, Borris-in-Ossory and Graiguecullen. We need to implement the occupied territories Bill to save the people of Palestine. We also need jobs.",
                "This promises to be a very right-wing Government. There needs to be a strong left-wing Opposition to hold it to account."
              ],
              "wordCount": 211
            },
            {
              "id": "spk_98",
              "speaker": {
                "id": "CharlesWard",
                "name": "Charles Ward",
                "uri": "/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:40:00+00:00",
              "speakerLabel": "Deputy Charles Ward",
              "paragraphs": [
                "The people of County Donegal sent me here with a mandate to fight for 100% redress. We demand action. We need to hold those responsible to account. I will not rest until this is achieved. The time for half-measures is over. The Government must deliver a true redress scheme - not a grant but a scheme that is led by science. There are 10,000 families in County Donegal that are currently affected by this. I am an affected homeowner. My children sleep in damp, mouldy rooms every single day, as do tens of thousands of others in Donegal. We have an opportunity in the next term to make this scheme happen. We need 100% redress and a scheme led by science. The current scheme is the most expensive way we can build. We are splitting semi-detached homes. We are putting people onto the streets. They have nowhere to go. Some 10,000 people are affected.",
                "We also need childcare facilities and leisure centres. A load of work needs to be done in Donegal. We are being abandoned. Donegal needs help. We need as much help as we can get. We have been fighting for years. This is the first time an affected homeowner, elected by the people of Donegal, has come to the floor of the Dáil."
              ],
              "wordCount": 216
            },
            {
              "id": "spk_99",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:40:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "I apologise to the Regional Group. There was a problem with the rotation; that group should have been first. The Regional Group, convened by Deputy Lowry, has speakers Deputies Harkin and Toole, who have six minutes."
              ],
              "wordCount": 36
            },
            {
              "id": "spk_100",
              "speaker": {
                "id": "MarianHarkinIND",
                "name": "Marian Harkin",
                "uri": "/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:40:00+00:00",
              "speakerLabel": "Deputy Marian Harkin",
              "paragraphs": [
                "Along with others, I mark this historic day, as the House has elected the first woman Ceann Comhairle. She follows in the footsteps of Cathal Brugha, our first Ceann Comhairle, who was elected on 21 January 1919, just over 105 years ago. I was very pleased to nominate Verona for the role of Ceann Comhairle, as I was to nominate Catherine Connolly as Leas-Cheann Comhairle five years ago, because of their competence and diligence and their suitability for this important role. In that context, I recognise the sterling work of our previous Ceann Comhairle, Seán Ó Fearghaíl. I knew Verona Murphy in a previous role, when I was an MEP. I met her on a regular basis when she represented the Irish Road Haulage Association in Brussels because much of the legislation impacting on road hauliers is decided at European level. What impressed me about Verona at that time was her knowledge, competence and precision. I value those qualities and I believe they will serve her well in her role as Ceann Comhairle.",
                "I thank the people of Sligo-Leitrim and south Donegal for electing me as one of their TDs. I will make a brief comment on what lies ahead for whatever new government is formed. The Irish people said to us that a major job of work is to be done with regard to housing, health, childcare, elder care, disability, immigration, child poverty, regional disparities, climate change, carers and public sector reform. We expect the Government to get on with it. The people have spoken. There is no second guessing. The numbers are in and there is no argument with the outcome. It is our responsibility to implement the will of the people. However, like any mandate, it is conditional. It is our duty as elected Members to serve the people. It is a huge challenge for all of us but it is a noble one. Every one of us in the House has a responsibility to listen to what we have been told by the electorate. I have listened very carefully to that message. It will guide my actions, along with my colleagues in the Regional Group.",
                "I wish everyone a happy Christmas. I hope that 2025 will bring about good government and good outcomes for the Irish people."
              ],
              "wordCount": 381
            },
            {
              "id": "spk_101",
              "speaker": {
                "id": "PeadarToibin",
                "name": "Peadar Tóibín",
                "uri": "/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:40:00+00:00",
              "speakerLabel": "Deputy Peadar Tóibín",
              "paragraphs": [
                "Déanaim comhghairdeas leis an gCeann Comhairle mar gheall ar a post nua agus gabhaim buíochas le Seán Ó Fearghaíl as an bpost iontach a rinne sé thar na blianta freisin. I thank the good people of County Meath for the opportunity to represent them in this Dáil. It is an honour and a privilege to be a TD, especially for a great county such as Meath.",
                "The year 2024 has been a good one for Aontú. We successfully fought two referendums. We won council seats. We surpassed the Labour Party, the Social Democrats and People Before Profit in votes in the European elections. We challenged the establishment parties in the elections in the North of Ireland. We achieved a doubling of our vote in the elections just gone by. Indeed, we had the highest increase in votes for any political party since 2020 in those elections. We have added to our Dáil tally with Deputy Paul Lawless, helping to redraw the political map of County Mayo. I welcome him to the Dáil. I thank the nearly 100,000 people who voted for us in this election. The progress in those votes in down to the candidates, members and activists of Aontú; buíochas ó chroí uaim.",
                "It has been three weeks since the general election. A frustration is growing among the general public regarding the slow progress of government formation. A number of Opposition parties have no real interest in getting into government, yet are taking part in government formation talks. Even today, the largest Opposition party has put Mary Lou McDonald forward for the position of Taoiseach, full sure in the knowledge there is no chance that can happen. It is the case that we have many bread-and-butter issues affecting our society at the moment. They need delivery. They do not need pointless and meaningless theatre. I agree with Mary Lou McDonald that it would be damaging to put Fine Gael back into government for what would cumulatively be 19 years. It is also important that Sinn Féin fully rules out negotiations with Fine Gael on the next government. It has not done that to date.",
                "The Tánaiste spoke of his party being against short-termism. There is no doubt that this Government does not do short-termism. Most of the infrastructural projects in the country are grinding to a glacial halt at present. The Government is now talking about coming back on 22 January. To come back two months after the general election to potentially get started on the jobs of work is way too late. Urgency is not just for general elections. Urgency should be for governments as well."
              ],
              "wordCount": 438
            },
            {
              "id": "spk_102",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:40:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "We now move to the technical group convened by Deputy Michael Collins. It has six minutes shared between Deputies Richard O'Donoghue, Michael Healy-Rae, O'Flynn, Gogarty and Danny Healy-Rae."
              ],
              "wordCount": 28
            },
            {
              "id": "spk_103",
              "speaker": {
                "id": "RichardODonoghue",
                "name": "Richard O'Donoghue",
                "uri": "/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:50:00+00:00",
              "speakerLabel": "Deputy Richard O'Donoghue",
              "paragraphs": [
                "I congratulate the Ceann Comhairle on her position and Deputy Seán Ó Fearghaíl on the great work he did in his time in the Chair.",
                "I thank everyone in County Limerick who voted for me and entrusted me to serve in the Thirty-fourth Dáil. I thank all the canvassers, all the office staff, all my family and all my friends who entrusted me to represent them in Limerick and the rest of the country.",
                "I am a numbers person and looked at the vote result on the election of the Ceann Comhairle. I have been listening to the media and social media saying for the past several weeks that the next Government would include Fianna Fáil, Fine Gael and Independents, yet when you look at the numbers today you see they do not stack up. Eighty-nine voted for the Ceann Comhairle, who was backed by the former Government parties, but if you take out the vote of the Ceann Comhairle, that amounts to 88. When the two Fianna Fáil Members were taken out, it left Sinn Féin and Independents beaten by a majority of only one. Are there defectors already in Fianna Fáil and Fine Gael? It shows only 88 out of a possible how many. It is something to think about over the Christmas. I wish you all a very happy Christmas."
              ],
              "wordCount": 223
            },
            {
              "id": "spk_104",
              "speaker": {
                "id": "MichaelHealyRae",
                "name": "Michael Healy-Rae",
                "uri": "/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:50:00+00:00",
              "speakerLabel": "Deputy Michael Healy-Rae",
              "paragraphs": [
                "I wish the Ceann Comhairle good luck in her role. I know she will be very successful, fair and diligent. I thank Deputy Seán Ó Fearghaíl for his excellent work in the Chair. Most importantly, I thank the people who walked the roads for me for many months – the canvassers, the people who put up posters and worked very diligently – and of course the many people who voted for me and my brother Danny. I welcome the people who have come up here today, the supporters from County Kerry, and Councillors Johnny, Maura and Jackie Healy-Rae. I welcome them here today because they are an integral part of the team that keeps the Healy-Rae machine working in County Kerry. We look forward to rolling up our sleeves to work in whatever way we can as representatives. We have three things on an agenda, and those three things are Kerry, Kerry, Kerry, and the rest of the country after that. We will do the job to the best of our ability at all times. I look forward to working with everyone. I congratulate all the new people here today. I wish them good luck in their roles."
              ],
              "wordCount": 198
            },
            {
              "id": "spk_105",
              "speaker": {
                "id": "KenOFlynn",
                "name": "Ken O'Flynn",
                "uri": "/ie/oireachtas/member/id/Ken-O'Flynn.D.2024-11-29"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:50:00+00:00",
              "speakerLabel": "Deputy Ken O'Flynn",
              "paragraphs": [
                "I congratulate the Ceann Comhairle on her new position. I have so many people to thank for electing me and trusting me, not just the people of Cork North-Central but also my campaign manager, former Deputy Noel O’Flynn, who served in this House from 1997 to 2011. I thank him most sincerely for everything he has done for me as my father and of course as a Deputy. He was the one who really taught me that you must stand up for what you believe in, even if you stand alone.",
                "To the people of Cork North-Central, I thank them again for entrusting me to serve them. There are many issues I wish to raise and I will do so on their behalf. They include water, the lack of infrastructure in Cork North-Central, the lack of a counterbalanced city and taking it seriously.",
                "I wish everybody a happy, holy and peaceful Christmas. I look forward to working with everybody in this House. I have to point out that I am a little disappointed to hear people in this House already saying they want to represent only certain classes of people or certain people. Surely we are in this House to work together and for everybody."
              ],
              "wordCount": 205
            },
            {
              "id": "spk_106",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:50:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "I call Deputy Paul Gogarty."
              ],
              "wordCount": 5
            },
            {
              "id": "spk_107",
              "speaker": {
                "id": "PaulNicholasGogartyGP",
                "name": "Paul Nicholas Gogarty",
                "uri": "/ie/oireachtas/member/id/Paul-Nicholas-Gogarty.D.2002-06-06"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:50:00+00:00",
              "speakerLabel": "Deputy Paul Nicholas Gogarty",
              "paragraphs": [
                "Go raibh maith agat, a Cheann Comhairle, agus comhghairdeas.",
                "I thank all the constituents in Dublin Mid-West who elected me and put their faith in me. In the very limited time I have, I would like to recall how long it has been since I was an elected Member here. It is almost 14 years. Back in 2011, the amount of carbon in the atmosphere was 391 ppm. It is now 428 ppm. Our emissions per head of population continue to increase. That is the sad vista that faces us, the big international challenge, but we have so many national challenges that we have to face as well. The other thing I remember from 2011 is that there was a lot of grandstanding and a lot of hot air. Feicimid an seanscéal céanna arís.",
                "Deputy Mary Lou McDonald may make an excellent Taoiseach next year or at some stage but her nomination today was premature. Sinn Féin knew it. It did not talk to all the Members who may support a Sinn Féin government. The outgoing Government had a chance to put in something new, but so far it looks like a cold or lukewarm bit of tea with a bag still in it at a convenience store in Thurles. We need to think bigger."
              ],
              "wordCount": 215
            },
            {
              "id": "spk_108",
              "speaker": {
                "id": "DannyHealyRae",
                "name": "Danny Healy-Rae",
                "uri": "/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
              },
              "role": null,
              "recordedTime": "2024-12-18T17:50:00+00:00",
              "speakerLabel": "Deputy Danny Healy-Rae",
              "paragraphs": [
                "I congratulate Deputy Verona Murphy on being elevated to the high office of Ceann Comhairle and wish her well. I thank the outgoing Ceann Comhairle, Deputy Seán Ó Fearghaíl, for his dedication and the fair play he afforded to everyone in this Chamber, because he did. We will remember him. He changed many things that applied under previous Cinn Chomhairle for the better.",
                "I thank the people of Kerry who entrusted me and elected me for a third time to represent them. My focus will be on Kerry and the people of Kerry day in and day out. Like Deputy Michael Healy-Rae said, it is the people of Ireland after those of Kerry – Kerry first and the rest of the country after it.",
                "I thank my canvassers and the people who put up posters for me and went around the roads with me day and night. I thank my team, led by Johnny Healy-Rae and Maura Healy-Rae, who happens to be the Mayor of Killarney, which I am very proud of. They are two great councillors. Deputy Michael Healy-Rae’s son, Jack, is a great councillor as well.",
                "Again, I say to the Ceann Comhairle that it is about Kerry and the people of Kerry. I am glad they entrusted me to serve them here for the third time."
              ],
              "wordCount": 219
            },
            {
              "id": "spk_109",
              "speaker": {
                "id": "RodericOGorman",
                "name": "Roderic O'Gorman",
                "uri": "/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08"
              },
              "role": {
                "id": "Minister_for_Children,_Equality,_Disability,_Integration_and_Youth",
                "name": "Minister for Children, Equality, Disability, Integration and Youth",
                "uri": "/ie/oireachtas/role/minister/children__equality__disability__integration__youth"
              },
              "recordedTime": "2024-12-18T17:50:00+00:00",
              "speakerLabel": "Minister for Children, Equality, Disability, Integration and Youth (Deputy Roderic O'Gorman)",
              "paragraphs": [
                "I thank the Ceann Comhairle. I am delighted to have the opportunity to address her here from my new perch on the backbenches. I am at the very edge of the Government side right now, clinging on for a few more weeks, but I am very aware that a cold wind will soon blow, pluck me up and deposit me on the Opposition side of the House. However, I am pleased to be here and the Green Party is pleased to be here.",
                "On a very serious note, I thank the people of Dublin West for renewing their trust, faith and confidence in me for another term of office. I pay tribute to my Green Party colleagues who were not returned to the Thirty-fourth Dáil.",
                "I congratulate the Ceann Comhairle on her election today. It is a huge honour for her but also a moment of real significance for Dáil Éireann in that, after over a century, we have finally elected our first woman Ceann Comhairle. I have no doubt that she will carry out her duties with honour, distinction and fairness, and she will have my full support in doing so. When we spoke earlier in the week, I recalled the efficiency with which she chaired a number of debates in the last Oireachtas. I have a sneaking suspicion that a couple of our colleagues here who have a more flexible relationship with timekeeping and, in particular, how it applies to them will get a bit of a land in the weeks to come.",
                "When the Ceann Comhairle and I spoke during the week, I indicated I was going to give my number-one vote to Deputy Seán Ó Fearghaíl, and that is what I did. I thank Seán for the manner in which he carried out his duties over the past eight years. I also thank him for the personal courtesy and genuine kindness he afforded to me as a new Minister learning on the job.",
                "Political capital is a strangely intangible thing. It is not something that can be saved up, it does not accumulate interest, and it does not only grow in size; it is fleeting, can depreciate and can disappear. In 2020, my party had political capital and we spent it over the next four and a half years. The election outcome was hard for us but not for one second do I or any other former member of our parliamentary party regret our participation in government. Green Party Ministers advanced over 40 Bills in the House over the past four and half years and impacted positively on multiple Bills.",
                "I always ask what is the point of sitting in these seats and being granted the highest privilege our democracy can bestow if it is not about seizing the opportunity to deliver real and meaningful change for the good of all people. In the election three weeks ago, two parties of the centre left were given political capital by voters. I urge my colleagues in the Labour Party and the Social Democrats to take the opportunity they have been given. The decisions they make in their engagement with Fianna Fáil and Fine Gael will have a direct impact on the direction our country takes over the next four or five years. We are at a crossroads. The new Government could continue to have a strong progressive element and advocate climate action, strong public services and a humane approach to migration or it could have a fundamentally more conservative approach. While the outcome of the vote for Ceann Comhairle indicates that, right now, one element is in the ascendant, nothing is decided until the Taoiseach is elected. Our country needs progressive leadership right now. I urge the parties to grasp this opportunity while they have it because there is absolutely no guarantee that the same opportunity will be around in five years' time."
              ],
              "wordCount": 646
            }
          ],
          "subsections": [
            {
              "id": "dbsect_9",
              "title": null,
              "debateType": null,
              "recordedTime": null,
              "containsDebate": null,
              "question": null,
              "speeches": [],
              "subsections": [
                {
                  "id": "dbsect_10",
                  "title": null,
                  "debateType": null,
                  "recordedTime": null,
                  "containsDebate": null,
                  "question": null,
                  "speeches": [],
                  "subsections": [],
                  "metadata": null
                },
                {
                  "id": "dbsect_11",
                  "title": null,
                  "debateType": null,
                  "recordedTime": null,
                  "containsDebate": null,
                  "question": null,
                  "speeches": [],
                  "subsections": [],
                  "metadata": null
                },
                {
                  "id": "dbsect_12",
                  "title": null,
                  "debateType": null,
                  "recordedTime": null,
                  "containsDebate": null,
                  "question": null,
                  "speeches": [],
                  "subsections": [],
                  "metadata": null
                }
              ],
              "metadata": null
            }
          ],
          "metadata": {
            "debateType": "debate",
            "counts": {
              "speakerCount": 35,
              "speechCount": 87
            },
            "containsDebate": true,
            "parentId": null
          }
        },
        {
          "id": "dbsect_13",
          "title": "An Dáil a chur ar Athló",
          "debateType": "debate",
          "recordedTime": "2024-12-18T18:00:00+00:00",
          "containsDebate": false,
          "question": null,
          "speeches": [],
          "subsections": [],
          "metadata": {
            "debateType": "debate",
            "counts": {
              "speakerCount": 0,
              "speechCount": 0
            },
            "containsDebate": false,
            "parentId": null
          }
        },
        {
          "id": "dbsect_14",
          "title": "Adjournment of Dáil",
          "debateType": "debate",
          "recordedTime": "2024-12-18T18:00:00+00:00",
          "containsDebate": true,
          "question": null,
          "speeches": [
            {
              "id": "spk_110",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T18:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "We now move to the topic of the adjournment of the Dáil. The House must now decide when it will next sit. Accordingly, I call the Government Chief Whip, Deputy Naughton, to make a proposal on the adjournment of the House."
              ],
              "wordCount": 41
            },
            {
              "id": "spk_111",
              "speaker": {
                "id": "HildegardeNaughton",
                "name": "Hildegarde Naughton",
                "uri": "/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
              },
              "role": {
                "id": "Minister_of_State_at_the_Department_of_the_Taoiseach",
                "name": "Minister of State at the Department of the Taoiseach",
                "uri": "/ie/oireachtas/role/minister_state/taoiseach"
              },
              "recordedTime": "2024-12-18T18:00:00+00:00",
              "speakerLabel": "Minister of State at the Department of the Taoiseach (Deputy Hildegarde Naughton)",
              "paragraphs": [
                "I move: \"That the Dáil now adjourn until 12 midday, Wednesday, 22 January 2025.\""
              ],
              "wordCount": 14
            },
            {
              "id": "spk_112",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T18:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "Is that agreed?"
              ],
              "wordCount": 3
            },
            {
              "id": "spk_113",
              "speaker": {
                "id": "PadraigMacLochlainn",
                "name": "Pádraig Mac Lochlainn",
                "uri": "/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T18:00:00+00:00",
              "speakerLabel": "Deputy Pádraig Mac Lochlainn",
              "paragraphs": [
                "It is not agreed, a Cheann Comhairle."
              ],
              "wordCount": 7
            },
            {
              "id": "spk_114",
              "speaker": {
                "id": "VeronaMurphy",
                "name": "Verona Murphy",
                "uri": "/ie/oireachtas/member/id/Verona-Murphy.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T18:00:00+00:00",
              "speakerLabel": "An Ceann Comhairle",
              "paragraphs": [
                "I propose to take one minute from each Deputy who raises their hand."
              ],
              "wordCount": 13
            },
            {
              "id": "spk_115",
              "speaker": {
                "id": "PadraigMacLochlainn",
                "name": "Pádraig Mac Lochlainn",
                "uri": "/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
              },
              "role": null,
              "recordedTime": "2024-12-18T18:00:00+00:00",
              "speakerLabel": "Deputy Pádraig Mac Lochlainn",
              "paragraphs": [
                "As the Ceann Comhairle knows, the Whips met last night and the Opposition whips made it clear that we felt the Dáil should reconvene, as is normal after the Christmas recess, on 15 January. That is plenty of time; it is four full weeks from now. It is, therefore, unacceptable to suggest we come back on 22 January. People are crying out for leadership. They are crying out for solutions to their problems. We need to reconvene on 15 January, as is normal, after the Christmas recess. It is four long weeks, five is unacceptable."
              ],
              "wordCount": 95
            },
            {
              "id": "spk_116",
              "speaker": {
                "id": "PaulMurphy",
                "name": "Paul Murphy",
                "uri": "/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10"
              },
              "role": null,
              "recordedTime": "2024-12-18T18:00:00+00:00",
              "speakerLabel": "Deputy Paul Murphy",
              "paragraphs": [
                "The idea that we would break for more than one month and not even discuss the issues when people are going to sleep in emergency accommodation over Christmas and when there are not enough food parcels to go around is not acceptable. We should put pressure to say we have the date of 15 January and that is when we are reconvening. That focuses the minds in terms of the various parties that are engaged in coalition discussions. If they have a coalition and a nomination for Taoiseach to bring at that stage then that is fine, we vote on it. If they do not, we take the time to debate the issues of the day that are pressing. We have been elected here to be messengers of the people, and we need to have a chance to have our voices heard. Vincent Browne tweeted just after the election: \"There is no reason why we can’t have a new government next Tuesday. FF/FG need to lock in 8 Independents, which should take an hour and a half.\" Maybe it will take a little bit longer than an hour and a half, but the idea that we go away for a month is not acceptable."
              ],
              "wordCount": 204
            },
            {
              "id": "spk_117",
              "speaker": {
                "id": "IvanaBacik",
                "name": "Ivana Bacik",
                "uri": "/ie/oireachtas/member/id/Ivana-Bacik.S.2007-07-23"
              },
              "role": null,
              "recordedTime": "2024-12-18T18:00:00+00:00",
              "speakerLabel": "Deputy Ivana Bacik",
              "paragraphs": [
                "We, too, believe we should be reconvening on 15 January. So many urgent challenges face our society. Indeed, we have just spent the bulk of this afternoon outlining what those challenges are, and I think there is actually agreement on that. Even the Government acknowledges the immense challenges, particularly on housing and healthcare, and the immense challenges that may indeed arise due to other issues and incidents. I spoke earlier about the Holyhead port closure and the enormous pressure that is putting on so many people and so many businesses over this Christmas period. Therefore, I simply do not believe it would be appropriate for us to delay convening this House again until so late in January. The date of 15 January was actually set by the previous Dáil. It is the date on which we had all anticipated we would be returning, and we frankly do not see a rationale for delaying beyond that."
              ],
              "wordCount": 155
            },
            {
              "id": "spk_118",
              "speaker": {
                "id": "CianOCallaghan",
                "name": "Cian O'Callaghan",
                "uri": "/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T18:00:00+00:00",
              "speakerLabel": "Deputy Cian O'Callaghan",
              "paragraphs": [
                "The date is hard to understand given the election that has just taken place and the pressing issues people raised with us as we have been out campaigning. There is a need for urgent action to address the climate crisis. There is an urgent need to do something about children with disabilities waiting for assessments of need and waiting for services, and to address the crisis in our healthcare and our hospitals. Elderly people are left waiting on chairs for 30 hours when they are sick and unwell and need rest and recuperation. Record numbers of people are without a home going into Christmas. Today, we had the news that house prices have gone up again in the past 12 months by almost 10%. These are huge crises we have now on which we need urgent action, so the idea of delaying the Dáil coming back is utterly unacceptable and sends an incredibly bad message to the electorate who put their faith in electing us to this Dáil."
              ],
              "wordCount": 168
            },
            {
              "id": "spk_119",
              "speaker": {
                "id": "RichardODonoghue",
                "name": "Richard O'Donoghue",
                "uri": "/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08"
              },
              "role": null,
              "recordedTime": "2024-12-18T18:00:00+00:00",
              "speakerLabel": "Deputy Richard O'Donoghue",
              "paragraphs": [
                "I have been in business all my life - over 30 years self-employed. We might look at all the SMEs in this country. We are breaking in my business on Friday. We are back on 6 January. Most businesses around this country are working. What is wrong with this Chamber coming back to work? This is the division between real workers and real business and this Chamber. The Government is afraid to come back to work early. Why not come back on 15 January and get the work done? Everyone else in this country is going to be working. Why can we not have this House working? That is what I stand for - the working class people in this country. There is no reward for anyone in this country who works, but all the rewards are coming back into this Chamber where the Government wants to take a break until 22 January. I have no problem coming back in on 15 January because I will be back to work myself on 6 January."
              ],
              "wordCount": 174
            }
          ],
          "subsections": [
            {
              "id": "dbsect_15",
              "title": null,
              "debateType": null,
              "recordedTime": null,
              "containsDebate": null,
              "question": null,
              "speeches": [],
              "subsections": [
                {
                  "id": "dbsect_16",
                  "title": null,
                  "debateType": null,
                  "recordedTime": null,
                  "containsDebate": null,
                  "question": null,
                  "speeches": [],
                  "subsections": [],
                  "metadata": null
                },
                {
                  "id": "dbsect_17",
                  "title": null,
                  "debateType": null,
                  "recordedTime": null,
                  "containsDebate": null,
                  "question": null,
                  "speeches": [],
                  "subsections": [],
                  "metadata": null
                },
                {
                  "id": "dbsect_18",
                  "title": null,
                  "debateType": null,
                  "recordedTime": null,
                  "containsDebate": null,
                  "question": null,
                  "speeches": [],
                  "subsections": [],
                  "metadata": null
                }
              ],
              "metadata": null
            }
          ],
          "metadata": {
            "debateType": "debate",
            "counts": {
              "speakerCount": 7,
              "speechCount": 10
            },
            "containsDebate": true,
            "parentId": null
          }
        }
      ],
      "stats": {
        "sections": 18,
        "speeches": 119,
        "uniqueSpeakerIds": [
          "JohnMcGuinness",
          "VeronaMurphy",
          "SeanOFearghaillFF",
          "AengusOSnodaighSF",
          "SimonHarris",
          "MaryLouMcDonald",
          "PadraigMacLochlainn",
          "PearseDoherty",
          "JoannaByrne",
          "MichaelMartin",
          "MattCarthy",
          "IvanaBacik",
          "CianOCallaghan",
          "RoryHearne",
          "MichaelLowry",
          "SeamusHealy",
          "RuthCoppinger",
          "RichardBoydBarrett",
          "MichaelCollins2016",
          "JohnBrady",
          "EoinOBroin",
          "PaulMcAuliffe",
          "TimDooley",
          "PadraigRice",
          "JenCummins",
          "LiamQuaide",
          "AidanFarrelly",
          "CatherineConnolly",
          "PaulMurphy",
          "BrianStanley",
          "CharlesWard",
          "MarianHarkinIND",
          "PeadarToibin",
          "RichardODonoghue",
          "MichaelHealyRae",
          "KenOFlynn",
          "PaulNicholasGogartyGP",
          "DannyHealyRae",
          "RodericOGorman",
          "HildegardeNaughton"
        ],
        "wordCount": 22717
      }
    }
  ]
}